-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Фев 06 2026 г., 16:46
-- Версия сервера: 8.0.30
-- Версия PHP: 8.1.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `furniture_shop`
--

-- --------------------------------------------------------

--
-- Структура таблицы `attr_categories`
--

CREATE TABLE `attr_categories` (
  `id` int NOT NULL,
  `name` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `attr_categories`
--

INSERT INTO `attr_categories` (`id`, `name`) VALUES
(14, 'декор'),
(5, 'диван'),
(11, 'комод'),
(6, 'кресло'),
(8, 'кровать'),
(10, 'стеллаж'),
(7, 'стол'),
(12, 'стул'),
(13, 'тумба'),
(9, 'шкаф');

-- --------------------------------------------------------

--
-- Структура таблицы `attr_category_links`
--

CREATE TABLE `attr_category_links` (
  `id` int NOT NULL,
  `parent_cat_id` int NOT NULL,
  `linked_cat_id` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `attr_colors`
--

CREATE TABLE `attr_colors` (
  `id` int NOT NULL,
  `name` varchar(100) DEFAULT NULL,
  `color_code` varchar(20) DEFAULT NULL,
  `hex_code` varchar(7) DEFAULT '#cccccc'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `attr_colors`
--

INSERT INTO `attr_colors` (`id`, `name`, `color_code`, `hex_code`) VALUES
(2, 'белый', '#FFFFFF', '#ffffff'),
(4, 'розовый', NULL, '#ffc0cb'),
(5, 'дерево', NULL, '#A47551'),
(6, 'серый', '#808080', '#cccccc'),
(10, 'золото', NULL, '#cccccc'),
(13, 'прозрачный', NULL, '#cccccc'),
(14, 'черный', '#000000', '#000000'),
(15, 'коричневый', '#654321', '#a16330'),
(16, 'Красный', NULL, '#ff0000'),
(18, 'Бирюзовый', NULL, '#00e1ff'),
(19, 'Зеленый', NULL, '#0cb800');

-- --------------------------------------------------------

--
-- Структура таблицы `attr_materials`
--

CREATE TABLE `attr_materials` (
  `id` int NOT NULL,
  `name` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `attr_materials`
--

INSERT INTO `attr_materials` (`id`, `name`) VALUES
(6, 'Велюр'),
(3, 'дерево'),
(2, 'кожа'),
(4, 'металл'),
(5, 'стекло'),
(1, 'ткань');

-- --------------------------------------------------------

--
-- Структура таблицы `attr_rooms`
--

CREATE TABLE `attr_rooms` (
  `id` int NOT NULL,
  `name` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `attr_rooms`
--

INSERT INTO `attr_rooms` (`id`, `name`) VALUES
(1, 'гостиная'),
(2, 'кухня'),
(4, 'прихожая'),
(3, 'спальня');

-- --------------------------------------------------------

--
-- Структура таблицы `attr_room_links`
--

CREATE TABLE `attr_room_links` (
  `id` int NOT NULL,
  `room_id` int NOT NULL,
  `linked_cat_id` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `attr_styles`
--

CREATE TABLE `attr_styles` (
  `id` int NOT NULL,
  `name` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `attr_styles`
--

INSERT INTO `attr_styles` (`id`, `name`) VALUES
(8, 'дофаминовый'),
(3, 'классика'),
(2, 'лофт'),
(4, 'модерн'),
(5, 'прованс'),
(1, 'скандинавский');

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

CREATE TABLE `orders` (
  `id` int NOT NULL,
  `user_id` int NOT NULL,
  `total_price` decimal(10,2) NOT NULL,
  `address` text,
  `status` enum('new','paid','delivered','cancelled') DEFAULT 'new',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `orders`
--

INSERT INTO `orders` (`id`, `user_id`, `total_price`, `address`, `status`, `created_at`) VALUES
(1, 1, '183400.00', NULL, 'new', '2026-02-02 13:40:55'),
(2, 1, '5400.00', NULL, 'new', '2026-02-02 13:48:37'),
(3, 1, '16900.00', NULL, 'new', '2026-02-02 14:15:15'),
(4, 1, '16900.00', NULL, 'new', '2026-02-02 14:16:17'),
(5, 1, '16900.00', NULL, 'new', '2026-02-02 14:19:50'),
(6, 1, '16900.00', NULL, 'new', '2026-02-02 14:21:33'),
(7, 1, '16900.00', NULL, 'new', '2026-02-02 14:24:38'),
(8, 1, '42000.00', NULL, 'paid', '2026-02-02 15:50:05'),
(9, 1, '84000.00', NULL, 'paid', '2026-02-02 15:52:29'),
(10, 1, '84000.00', NULL, 'new', '2026-02-02 15:56:52'),
(11, 1, '6400.00', NULL, 'paid', '2026-02-03 12:15:24'),
(12, 2, '31900.00', NULL, 'paid', '2026-02-03 12:36:12'),
(13, 2, '16900.00', NULL, 'paid', '2026-02-03 12:41:51'),
(14, 1, '104000.00', 'улица Сильного д.15, г. Амбал, Спортивный Автономный Округ', 'paid', '2026-02-03 14:25:00'),
(15, 1, '26500.00', 'Самовывоз', 'paid', '2026-02-03 14:29:49'),
(16, 1, '15000.00', 'Самовывоз', 'paid', '2026-02-03 15:42:46'),
(17, 1, '23300.00', 'Самовывоз', 'paid', '2026-02-03 16:32:13'),
(18, 1, '15000.00', 'Самовывоз', 'paid', '2026-02-03 16:48:12'),
(19, 1, '42000.00', 'Самовывоз', 'delivered', '2026-02-03 17:04:00'),
(20, 1, '89000.00', 'Самовывоз', 'paid', '2026-02-03 17:09:04'),
(21, 1, '42000.00', 'Самовывоз', 'paid', '2026-02-04 11:04:34'),
(22, 2, '42000.00', 'Самовывоз', 'paid', '2026-02-05 11:38:49'),
(23, 2, '25000.00', 'Самовывоз', 'paid', '2026-02-05 13:15:09'),
(24, 2, '149800.00', 'Вайтран, дом Кузнеца', 'paid', '2026-02-05 13:23:46'),
(25, 2, '10700.00', 'Самовывоз', 'new', '2026-02-05 15:41:20'),
(27, 2, '27800.00', 'Самовывоз', 'new', '2026-02-05 16:03:36'),
(28, 1, '178400.00', 'Самовывоз', 'new', '2026-02-05 16:47:26'),
(29, 2, '10000.00', 'Самовывоз', 'new', '2026-02-06 10:49:31'),
(31, 6, '84000.00', 'Самовывоз', 'paid', '2026-02-06 13:28:35');

-- --------------------------------------------------------

--
-- Структура таблицы `order_items`
--

CREATE TABLE `order_items` (
  `id` int NOT NULL,
  `order_id` int NOT NULL,
  `product_id` int NOT NULL,
  `quantity` int NOT NULL,
  `price_at_time` decimal(10,2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `order_items`
--

INSERT INTO `order_items` (`id`, `order_id`, `product_id`, `quantity`, `price_at_time`) VALUES
(1, 1, 19, 2, '89000.00'),
(2, 1, 24, 1, '5400.00'),
(3, 2, 24, 1, '5400.00'),
(4, 3, 22, 1, '11500.00'),
(5, 3, 24, 1, '5400.00'),
(6, 4, 22, 1, '11500.00'),
(7, 4, 24, 1, '5400.00'),
(8, 5, 22, 1, '11500.00'),
(9, 5, 24, 1, '5400.00'),
(10, 6, 22, 1, '11500.00'),
(11, 6, 24, 1, '5400.00'),
(12, 7, 22, 1, '11500.00'),
(13, 7, 24, 1, '5400.00'),
(14, 8, 5, 1, '42000.00'),
(15, 9, 5, 2, '42000.00'),
(16, 10, 5, 2, '42000.00'),
(17, 11, 18, 2, '3200.00'),
(18, 12, 20, 1, '15000.00'),
(19, 12, 22, 1, '11500.00'),
(20, 12, 24, 1, '5400.00'),
(21, 13, 22, 1, '11500.00'),
(22, 13, 24, 1, '5400.00'),
(23, 14, 19, 1, '89000.00'),
(24, 14, 20, 1, '15000.00'),
(25, 15, 20, 1, '15000.00'),
(26, 15, 22, 1, '11500.00'),
(27, 16, 20, 1, '15000.00'),
(28, 17, 18, 2, '3200.00'),
(29, 17, 22, 1, '11500.00'),
(30, 17, 24, 1, '5400.00'),
(31, 18, 20, 1, '15000.00'),
(32, 19, 5, 1, '42000.00'),
(33, 20, 19, 1, '89000.00'),
(34, 21, 5, 1, '42000.00'),
(35, 22, 5, 1, '42000.00'),
(36, 23, 26, 1, '25000.00'),
(37, 24, 19, 1, '89000.00'),
(38, 24, 24, 2, '5400.00'),
(39, 24, 26, 2, '25000.00'),
(40, 25, 17, 1, '7500.00'),
(41, 25, 18, 1, '3200.00'),
(45, 27, 21, 1, '2800.00'),
(46, 27, 26, 1, '25000.00'),
(47, 28, 23, 1, '48000.00'),
(48, 28, 24, 1, '5400.00'),
(49, 28, 26, 5, '25000.00'),
(50, 29, 12, 1, '6800.00'),
(51, 29, 18, 1, '3200.00'),
(53, 31, 5, 2, '42000.00');

-- --------------------------------------------------------

--
-- Структура таблицы `products`
--

CREATE TABLE `products` (
  `id` int NOT NULL,
  `name` varchar(255) NOT NULL,
  `description` text,
  `price` decimal(10,2) NOT NULL,
  `image` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `color_id` int DEFAULT NULL,
  `material_id` int DEFAULT NULL,
  `category_id` int DEFAULT NULL,
  `style_id` int DEFAULT NULL,
  `room_id` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `products`
--

INSERT INTO `products` (`id`, `name`, `description`, `price`, `image`, `created_at`, `color_id`, `material_id`, `category_id`, `style_id`, `room_id`) VALUES
(5, 'Диван \"Нордик\"', 'Минималистичный трехместный диван с деревянными ножками.', '42000.00', 'https://images.unsplash.com/photo-1555041469-a586c61ea9bc?q=80&w=500', '2026-02-02 12:03:47', 6, 1, 5, 1, 1),
(6, 'Кресло \"Лофт Тауэр\"', 'Индустриальное кресло с металлическим каркасом.', '18500.00', 'https://images.unsplash.com/photo-1567538096630-e0c55bd6374c?q=80&w=500', '2026-02-02 12:03:47', 14, 2, 6, 2, 1),
(7, 'Стол \"Оак Сити\"', 'Массивный обеденный стол из натурального дуба.', '29000.00', 'https://images.unsplash.com/photo-1530018607912-eff2df114f11?q=80&w=500', '2026-02-02 12:03:47', 2, 3, 7, 3, 2),
(8, 'Кровать \"Дрим Лайн\"', 'Мягкое изголовье и ортопедическое основание.', '55000.00', 'https://images.unsplash.com/photo-1505693419163-57bb9a70a72d?q=80&w=500', '2026-02-02 12:03:47', 2, 1, 8, 4, 3),
(9, 'Шкаф \"Прованс\"', 'Белоснежный шкаф с резными элементами.', '38000.00', 'https://images.unsplash.com/photo-1595428774223-ef52624120d2?q=80&w=500', '2026-02-02 12:03:47', 2, 3, 9, 5, 3),
(10, 'Стеллаж \"Металл-Стиль\"', 'Открытый стеллаж для книг в стиле лофт.', '12000.00', 'https://images.unsplash.com/photo-1594620302200-9a762244a156?q=80&w=500', '2026-02-02 12:03:47', 14, 4, 10, 2, 4),
(11, 'Комод \"Сканди-6\"', 'Компактный комод с шестью ящиками.', '14500.00', 'https://images.unsplash.com/photo-1538688545213-f947ee0e3034?q=80&w=500', '2026-02-02 12:03:47', 5, 3, 11, 1, 3),
(12, 'Стул \"Вельвет\"', 'Обеденный стул с мягкой велюровой обивкой.', '6800.00', 'https://images.unsplash.com/photo-1580480055273-228ff5388ef8?q=80&w=500', '2026-02-02 12:03:47', 6, 1, 12, 4, 2),
(13, 'Тумба под ТВ \"Грей\"', 'Подвесная тумба с глянцевым покрытием.', '9900.00', 'https://images.unsplash.com/photo-1601054704854-1a2e79dea4d3?q=80&w=500', '2026-02-02 12:03:47', 6, 5, 13, 4, 1),
(14, 'Зеркало \"Ретро\"', 'Настенное зеркало в золотистой раме.', '4500.00', 'https://images.unsplash.com/photo-1618220252344-8ec99ec624b1?q=80&w=500', '2026-02-02 12:03:47', 10, 4, 14, 3, 4),
(15, 'Барный стул \"Высота\"', 'Для кухонного острова или барной стойки.', '8200.00', 'https://images.unsplash.com/photo-1503602642458-232111445657?q=80&w=500', '2026-02-02 12:03:47', 14, 4, 12, 2, 2),
(16, 'Кровать \"Скай\"', 'Минималистичная кровать без изножья.', '32000.00', 'https://images.unsplash.com/photo-1522771739844-6a9f6d5f14af?q=80&w=500', '2026-02-02 12:03:47', 2, 1, 8, 1, 3),
(17, 'Журнальный столик \"Круг\"', 'Столешница из закаленного стекла.', '7500.00', 'https://images.unsplash.com/photo-1533090161767-e6ffed986c88?q=80&w=500', '2026-02-02 12:03:47', 13, 5, 7, 4, 1),
(18, 'Полка \"Зигзаг\"', 'Необычная настенная полка для декора.', '3200.00', 'https://images.unsplash.com/photo-1594620302200-9a762244a156?q=80&w=500', '2026-02-02 12:03:47', 14, 3, 14, 2, 1),
(19, 'Диван \"Честерфилд\"', 'Классический кожаный диван с каретной стяжкой.', '89000.00', 'https://images.unsplash.com/photo-1550581190-9c1c48d21d6c?q=80&w=500', '2026-02-02 12:03:47', 15, 2, 5, 3, 1),
(20, 'Письменный стол \"Ворк\"', 'Широкая рабочая поверхность.', '15000.00', 'https://images.unsplash.com/photo-1518455027359-f3f8164ba6bd?q=80&w=500', '2026-02-02 12:03:47', 2, 3, 7, 1, 1),
(21, 'Вешалка \"Трипод\"', 'Напольная вешалка для верхней одежды.', '2800.00', 'https://images.unsplash.com/photo-1596450514735-3069c9f280a3?q=80&w=500', '2026-02-02 12:03:47', 2, 4, 14, 4, 4),
(22, 'Кресло-качалка \"Уют\"', 'Плетеное кресло из ротанга.', '11500.00', 'https://images.unsplash.com/photo-1519947486511-46149fa0a254?q=80&w=500', '2026-02-02 12:03:47', 5, 3, 6, 5, 1),
(23, 'Обеденная группа \"Квартет\"', 'Стол и 4 стула в едином стиле.', '48000.00', 'https://images.unsplash.com/photo-1520418672771-06d99c656047?q=80&w=500', '2026-02-02 12:03:47', 6, 3, 7, 1, 2),
(24, 'Тумбочка \"Прикроватная\"', 'Компактная тумба с одним ящиком.', '5400.00', 'https://images.unsplash.com/photo-1532372320572-cda25653a26d?q=80&w=500', '2026-02-02 12:03:47', 2, 3, 13, 4, 3),
(26, 'Тест Диван Крутой Мага', 'Крутой диван', '25000.00', '1770293647_73330235.jpg', '2026-02-05 12:14:07', 4, 4, 5, 8, 2);

-- --------------------------------------------------------

--
-- Структура таблицы `product_images`
--

CREATE TABLE `product_images` (
  `id` int NOT NULL,
  `product_id` int NOT NULL,
  `image_path` varchar(255) NOT NULL,
  `color_name` varchar(50) DEFAULT NULL,
  `is_main` tinyint(1) DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `product_images`
--

INSERT INTO `product_images` (`id`, `product_id`, `image_path`, `color_name`, `is_main`) VALUES
(1, 5, 'https://images.unsplash.com/photo-1555041469-a586c61ea9bc?w=500', 'серый', 1),
(2, 5, 'https://images.unsplash.com/photo-1550254478-ead40cc84479?w=500', 'серый', 0),
(3, 5, 'https://images.unsplash.com/photo-1524758631624-e2822e304c36?w=500', 'белый', 0),
(4, 5, 'https://images.unsplash.com/photo-1567016432779-094069958ad5?w=500', 'белый', 0),
(7, 26, '1770293647_73330235.jpg', 'розовый', 1),
(8, 26, '1770293647_c6791985.jpg', 'белый', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `product_related`
--

CREATE TABLE `product_related` (
  `id` int NOT NULL,
  `product_id` int NOT NULL,
  `related_id` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `product_related`
--

INSERT INTO `product_related` (`id`, `product_id`, `related_id`) VALUES
(2, 5, 19);

-- --------------------------------------------------------

--
-- Структура таблицы `settings`
--

CREATE TABLE `settings` (
  `key` varchar(50) NOT NULL,
  `value` text,
  `description` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `settings`
--

INSERT INTO `settings` (`key`, `value`, `description`) VALUES
('contact_email', 'info@fedosik.ru', 'Email для связи'),
('contact_phone', '+7 (999) 000-00-00', 'Контактный телефон'),
('shop_address', 'г. Москва, ул. Мебельная, д. 1', 'Адрес шоурума/офиса'),
('site_name', 'Fedosik Shop', 'Название магазина');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int NOT NULL,
  `email` varchar(100) NOT NULL,
  `password` varchar(255) NOT NULL,
  `role` enum('user','admin') DEFAULT 'user',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `avatar` varchar(255) DEFAULT NULL,
  `surname` varchar(255) DEFAULT '',
  `phone` varchar(20) DEFAULT '',
  `name` varchar(255) DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `email`, `password`, `role`, `created_at`, `avatar`, `surname`, `phone`, `name`) VALUES
(1, 'example@mail.ru', '$2y$10$vfpg8rp.ZtxnqMb/WcxuRu7YGOpWXs5rfjzaUVnUN2QDB8wi4U7RK', 'user', '2026-02-02 13:22:53', 'user_1_1770128207.jpg', 'КАЗИНО', '+7 (055) 966-40-36', 'ОНЛАЙН'),
(2, 'test@mail.ru', '$2y$10$QeXgvKigJtjY/gst9HgOn.pa7Z1JQOmnBXEY0Y7iATJC45f5nOFUC', 'admin', '2026-02-03 12:35:54', 'user_2_1770369104.png', 'Support', '+7 (055) 966-45-46', 'Danila'),
(4, 'egorMaga@mail.ru', '$2y$10$bSsZ2BUe0NSccaWg9dpKNege2JNBBqnJiR9DwBj/RYaB.JXKGddWi', 'user', '2026-02-05 16:06:06', 'user_4_1770307578.png', 'Дфарфовский', '+79003583370', 'Егор'),
(6, 'fedor@mail.ru', '$2y$10$mPtP4aAor1m1YHal8.wvs.nzisRUZhYX4CruiT.bjKXlLhLIfjfz2', 'admin', '2026-02-06 13:26:13', 'user_6_1770384392.png', 'Федор', '+7 (995) 248-84-79', 'Федор');

-- --------------------------------------------------------

--
-- Структура таблицы `visit_logs`
--

CREATE TABLE `visit_logs` (
  `id` int NOT NULL,
  `page_url` varchar(255) DEFAULT NULL,
  `visit_date` date DEFAULT (curdate()),
  `visit_time` time DEFAULT (curtime()),
  `ip_address` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `visit_logs`
--

INSERT INTO `visit_logs` (`id`, `page_url`, `visit_date`, `visit_time`, `ip_address`) VALUES
(1, '/', '2026-02-04', '15:22:01', '127.0.0.1'),
(2, '/', '2026-02-04', '15:22:27', '127.0.0.1'),
(3, '/index.php', '2026-02-04', '15:22:29', '127.0.0.1'),
(4, '/login.php', '2026-02-04', '15:22:30', '127.0.0.1'),
(5, '/login.php', '2026-02-04', '15:22:34', '127.0.0.1'),
(6, '/profile.php', '2026-02-04', '15:22:34', '127.0.0.1'),
(7, '/shop.php', '2026-02-04', '15:22:37', '127.0.0.1'),
(8, '/product.php?id=24', '2026-02-04', '15:22:38', '127.0.0.1'),
(9, '/shop.php', '2026-02-04', '15:22:41', '127.0.0.1'),
(10, '/product.php?id=22', '2026-02-04', '15:22:42', '127.0.0.1'),
(11, '/shop.php', '2026-02-04', '15:22:44', '127.0.0.1'),
(12, '/index.php', '2026-02-04', '15:22:49', '127.0.0.1'),
(13, '/index.php', '2026-02-04', '15:22:53', '127.0.0.1'),
(14, '/login.php', '2026-02-04', '15:22:54', '127.0.0.1'),
(15, '/login.php', '2026-02-04', '15:22:56', '127.0.0.1'),
(16, '/profile.php', '2026-02-04', '15:22:56', '127.0.0.1'),
(17, '/', '2026-02-05', '13:33:56', '127.0.0.1'),
(18, '/login.php', '2026-02-05', '13:34:29', '127.0.0.1'),
(19, '/login.php', '2026-02-05', '13:34:39', '127.0.0.1'),
(20, '/profile.php', '2026-02-05', '13:34:40', '127.0.0.1'),
(21, '/index.php', '2026-02-05', '13:53:49', '127.0.0.1'),
(22, '/login.php', '2026-02-05', '13:53:50', '127.0.0.1'),
(23, '/shop.php', '2026-02-05', '13:53:55', '127.0.0.1'),
(24, '/login.php', '2026-02-05', '13:54:55', '127.0.0.1'),
(25, '/login.php', '2026-02-05', '13:54:59', '127.0.0.1'),
(26, '/profile.php', '2026-02-05', '13:54:59', '127.0.0.1'),
(27, '/shop.php', '2026-02-05', '14:18:03', '127.0.0.1'),
(28, '/shop.php', '2026-02-05', '14:22:54', '127.0.0.1'),
(29, '/product.php?id=25', '2026-02-05', '14:23:07', '127.0.0.1'),
(30, '/shop.php', '2026-02-05', '14:23:09', '127.0.0.1'),
(31, '/product.php?id=25', '2026-02-05', '14:23:11', '127.0.0.1'),
(32, '/shop.php', '2026-02-05', '14:23:12', '127.0.0.1'),
(33, '/shop.php', '2026-02-05', '14:24:32', '127.0.0.1'),
(34, '/shop.php', '2026-02-05', '14:25:09', '127.0.0.1'),
(35, '/shop.php?search=&min_price=0&max_price=1000000&style=%D0%BF%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D1%81&room=&material%5B%5D=%D0%92%D0%B5%D0%BB%D1%8E%D1%80', '2026-02-05', '14:25:17', '127.0.0.1'),
(36, '/shop.php?search=&min_price=0&max_price=1000000&style=%D0%BF%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D1%81&room=', '2026-02-05', '14:25:20', '127.0.0.1'),
(37, '/shop.php?search=&min_price=0&max_price=1000000&style=%D0%BC%D0%BE%D0%B4%D0%B5%D1%80%D0%BD&room=', '2026-02-05', '14:25:29', '127.0.0.1'),
(38, '/shop.php?search=&min_price=0&max_price=1000000&style=%D0%BC%D0%BE%D0%B4%D0%B5%D1%80%D0%BD&room=&color%5B%5D=%D0%B4%D0%B5%D1%80%D0%B5%D0%B2%D0%BE', '2026-02-05', '14:25:34', '127.0.0.1'),
(39, '/shop.php?search=&min_price=0&max_price=1000000&style=%D0%BC%D0%BE%D0%B4%D0%B5%D1%80%D0%BD&room=&color%5B%5D=%D0%B1%D0%B5%D0%BB%D1%8B%D0%B9', '2026-02-05', '14:25:36', '127.0.0.1'),
(40, '/shop.php?search=&min_price=0&max_price=1000000&style=%D0%BC%D0%BE%D0%B4%D0%B5%D1%80%D0%BD&room=', '2026-02-05', '14:25:40', '127.0.0.1'),
(41, '/shop.php?search=&min_price=0&max_price=1000000&style=%D0%BC%D0%BE%D0%B4%D0%B5%D1%80%D0%BD&room=&material%5B%5D=%D0%BC%D0%B5%D1%82%D0%B0%D0%BB%D0%BB', '2026-02-05', '14:25:57', '127.0.0.1'),
(42, '/shop.php?search=&min_price=0&max_price=1000000&style=%D0%BB%D0%BE%D1%84%D1%82&room=', '2026-02-05', '14:26:02', '127.0.0.1'),
(43, '/shop.php?search=%D0%B4%D0%B5%D0%BA%D0%BE%D1%80&min_price=0&max_price=1000000&style=%D0%BB%D0%BE%D1%84%D1%82&room=', '2026-02-05', '14:26:12', '127.0.0.1'),
(44, '/shop.php?search=%D0%B4%D0%B8%D0%B2%D0%B0%D0%BD&min_price=0&max_price=1000000&style=%D0%BB%D0%BE%D1%84%D1%82&room=', '2026-02-05', '14:26:14', '127.0.0.1'),
(45, '/shop.php', '2026-02-05', '14:26:19', '127.0.0.1'),
(46, '/shop.php?search=&min_price=0&max_price=1000000&room=&color%5B%5D=%D0%B4%D0%B5%D1%80%D0%B5%D0%B2%D0%BE', '2026-02-05', '14:26:38', '127.0.0.1'),
(47, '/shop.php?search=&min_price=0&max_price=1000000&room=&color%5B%5D=%D0%B1%D0%B5%D0%BB%D1%8B%D0%B9', '2026-02-05', '14:26:41', '127.0.0.1'),
(48, '/shop.php?search=&min_price=0&max_price=1000000&room=&color%5B%5D=%D1%87%D0%B5%D1%80%D0%BD%D1%8B%D0%B9', '2026-02-05', '14:26:45', '127.0.0.1'),
(49, '/shop.php?search=&min_price=0&max_price=1000000&room=&color%5B%5D=%D1%81%D0%B5%D1%80%D1%8B%D0%B9', '2026-02-05', '14:26:47', '127.0.0.1'),
(50, '/shop.php?search=&min_price=0&max_price=1000000&room=&color%5B%5D=%D1%80%D0%BE%D0%B7%D0%BE%D0%B2%D1%8B%D0%B9', '2026-02-05', '14:26:51', '127.0.0.1'),
(51, '/shop.php?search=&min_price=0&max_price=1000000&room=&color%5B%5D=%D1%80%D0%BE%D0%B7%D0%BE%D0%B2%D1%8B%D0%B9', '2026-02-05', '14:26:54', '127.0.0.1'),
(52, '/shop.php?search=&min_price=0&max_price=1000000&room=', '2026-02-05', '14:26:56', '127.0.0.1'),
(53, '/product.php?id=25', '2026-02-05', '14:27:03', '127.0.0.1'),
(54, '/shop.php?search=&min_price=0&max_price=1000000&room=', '2026-02-05', '14:27:10', '127.0.0.1'),
(55, '/shop.php?search=&min_price=0&max_price=1000000&room=', '2026-02-05', '14:31:59', '127.0.0.1'),
(56, '/shop.php?search=&min_price=0&max_price=1000000&room=&color%5B%5D=%D1%80%D0%BE%D0%B7%D0%BE%D0%B2%D1%8B%D0%B9', '2026-02-05', '14:32:13', '127.0.0.1'),
(57, '/shop.php?search=&min_price=0&max_price=1000000&room=&color%5B%5D=%D0%B1%D0%B5%D0%BB%D1%8B%D0%B9&color%5B%5D=%D1%80%D0%BE%D0%B7%D0%BE%D0%B2%D1%8B%D0%B9', '2026-02-05', '14:32:16', '127.0.0.1'),
(58, '/shop.php?search=&min_price=0&max_price=1000000&room=&color%5B%5D=%D0%B1%D0%B5%D0%BB%D1%8B%D0%B9&color%5B%5D=%D0%BF%D1%80%D0%BE%D0%B7%D1%80%D0%B0%D1%87%D0%BD%D1%8B%D0%B9&color%5B%5D=%D1%80%D0%BE%D0%B7%D0%BE%D0%B2%D1%8B%D0%B9', '2026-02-05', '14:32:20', '127.0.0.1'),
(59, '/shop.php?search=&min_price=0&max_price=1000000&room=&color%5B0%5D=%D0%B1%D0%B5%D0%BB%D1%8B%D0%B9&color%5B1%5D=%D0%BF%D1%80%D0%BE%D0%B7%D1%80%D0%B0%D1%87%D0%BD%D1%8B%D0%B9&color%5B2%5D=%D1%80%D0%BE%D0%B7%D0%BE%D0%B2%D1%8B%D0%B9&page=2', '2026-02-05', '14:32:22', '127.0.0.1'),
(60, '/shop.php?search=&min_price=0&max_price=1000000&room=&color%5B0%5D=%D0%B1%D0%B5%D0%BB%D1%8B%D0%B9&color%5B1%5D=%D0%BF%D1%80%D0%BE%D0%B7%D1%80%D0%B0%D1%87%D0%BD%D1%8B%D0%B9&color%5B2%5D=%D1%80%D0%BE%D0%B7%D0%BE%D0%B2%D1%8B%D0%B9&page=1', '2026-02-05', '14:32:24', '127.0.0.1'),
(61, '/shop.php?search=&min_price=0&max_price=1000000&room=&color%5B0%5D=%D0%B1%D0%B5%D0%BB%D1%8B%D0%B9&color%5B1%5D=%D0%BF%D1%80%D0%BE%D0%B7%D1%80%D0%B0%D1%87%D0%BD%D1%8B%D0%B9&color%5B2%5D=%D1%80%D0%BE%D0%B7%D0%BE%D0%B2%D1%8B%D0%B9&page=1&sort=price_asc', '2026-02-05', '14:32:26', '127.0.0.1'),
(62, '/shop.php?search=&min_price=0&max_price=1000000&room=&color%5B0%5D=%D0%B1%D0%B5%D0%BB%D1%8B%D0%B9&color%5B1%5D=%D0%BF%D1%80%D0%BE%D0%B7%D1%80%D0%B0%D1%87%D0%BD%D1%8B%D0%B9&color%5B2%5D=%D1%80%D0%BE%D0%B7%D0%BE%D0%B2%D1%8B%D0%B9&page=1&sort=new', '2026-02-05', '14:32:27', '127.0.0.1'),
(63, '/shop.php?search=&min_price=0&max_price=1000000&room=&color%5B0%5D=%D0%B1%D0%B5%D0%BB%D1%8B%D0%B9&color%5B1%5D=%D0%BF%D1%80%D0%BE%D0%B7%D1%80%D0%B0%D1%87%D0%BD%D1%8B%D0%B9&color%5B2%5D=%D1%80%D0%BE%D0%B7%D0%BE%D0%B2%D1%8B%D0%B9&page=1&sort=price_desc', '2026-02-05', '14:32:27', '127.0.0.1'),
(64, '/shop.php?search=&min_price=0&max_price=1000000&room=&color%5B0%5D=%D0%B1%D0%B5%D0%BB%D1%8B%D0%B9&color%5B1%5D=%D0%BF%D1%80%D0%BE%D0%B7%D1%80%D0%B0%D1%87%D0%BD%D1%8B%D0%B9&color%5B2%5D=%D1%80%D0%BE%D0%B7%D0%BE%D0%B2%D1%8B%D0%B9&page=1&sort=price_desc', '2026-02-05', '14:33:00', '127.0.0.1'),
(65, '/shop.php', '2026-02-05', '14:33:01', '127.0.0.1'),
(66, '/shop.php', '2026-02-05', '14:35:11', '127.0.0.1'),
(67, '/shop.php', '2026-02-05', '14:35:23', '127.0.0.1'),
(68, '/shop.php?page=2', '2026-02-05', '14:35:25', '127.0.0.1'),
(69, '/shop.php?page=3', '2026-02-05', '14:35:26', '127.0.0.1'),
(70, '/shop.php?page=4', '2026-02-05', '14:35:27', '127.0.0.1'),
(71, '/shop.php?page=1', '2026-02-05', '14:35:28', '127.0.0.1'),
(72, '/shop.php?page=1', '2026-02-05', '14:37:40', '127.0.0.1'),
(73, '/shop.php?page=1&sort=price_asc', '2026-02-05', '14:37:42', '127.0.0.1'),
(74, '/shop.php?page=1&sort=price_desc', '2026-02-05', '14:37:42', '127.0.0.1'),
(75, '/shop.php?page=1&sort=new', '2026-02-05', '14:37:43', '127.0.0.1'),
(76, '/product.php?id=24', '2026-02-05', '14:38:17', '127.0.0.1'),
(77, '/shop.php?page=1&sort=new', '2026-02-05', '14:38:19', '127.0.0.1'),
(78, '/product.php?id=5', '2026-02-05', '14:38:25', '127.0.0.1'),
(79, '/cart.php', '2026-02-05', '14:38:43', '127.0.0.1'),
(80, '/checkout.php', '2026-02-05', '14:38:45', '127.0.0.1'),
(81, '/checkout.php', '2026-02-05', '14:38:49', '127.0.0.1'),
(82, '/profile.php?order_success=1', '2026-02-05', '14:38:49', '127.0.0.1'),
(83, '/shop.php', '2026-02-05', '14:39:14', '127.0.0.1'),
(84, '/shop.php', '2026-02-05', '14:41:09', '127.0.0.1'),
(85, '/shop.php', '2026-02-05', '14:42:17', '127.0.0.1'),
(86, '/shop.php', '2026-02-05', '14:43:42', '127.0.0.1'),
(87, '/shop.php?page=2', '2026-02-05', '14:43:49', '127.0.0.1'),
(88, '/shop.php?page=3', '2026-02-05', '14:43:51', '127.0.0.1'),
(89, '/shop.php?page=4', '2026-02-05', '14:43:53', '127.0.0.1'),
(90, '/shop.php?page=1', '2026-02-05', '14:43:55', '127.0.0.1'),
(91, '/shop.php?page=1', '2026-02-05', '15:14:12', '127.0.0.1'),
(92, '/profile.php', '2026-02-05', '15:14:23', '127.0.0.1'),
(93, '/shop.php', '2026-02-05', '15:14:41', '127.0.0.1'),
(94, '/shop.php', '2026-02-05', '15:15:43', '127.0.0.1'),
(95, '/shop.php?search=&min_price=0&max_price=1000000&room=&color%5B%5D=%D0%91%D0%B8%D1%80%D1%8E%D0%B7%D0%BE%D0%B2%D1%8B%D0%B9', '2026-02-05', '15:15:47', '127.0.0.1'),
(96, '/shop.php', '2026-02-05', '15:15:48', '127.0.0.1'),
(97, '/shop.php', '2026-02-05', '15:17:19', '127.0.0.1'),
(98, '/product.php?id=27', '2026-02-05', '15:17:24', '127.0.0.1'),
(99, '/shop.php', '2026-02-05', '15:20:53', '127.0.0.1'),
(100, '/product.php?id=27', '2026-02-05', '15:22:30', '127.0.0.1'),
(101, '/product.php?id=27', '2026-02-05', '15:23:06', '127.0.0.1'),
(102, '/shop.php', '2026-02-05', '15:40:11', '127.0.0.1'),
(103, '/shop.php', '2026-02-05', '15:42:35', '127.0.0.1'),
(104, '/shop.php', '2026-02-05', '15:42:36', '127.0.0.1'),
(105, '/shop.php', '2026-02-05', '15:42:38', '127.0.0.1'),
(106, '/shop.php', '2026-02-05', '15:42:57', '127.0.0.1'),
(107, '/shop.php', '2026-02-05', '15:44:50', '127.0.0.1'),
(108, '/shop.php', '2026-02-05', '15:46:20', '127.0.0.1'),
(109, '/shop.php?sort=price_asc&page=1', '2026-02-05', '15:46:27', '127.0.0.1'),
(110, '/shop.php?sort=new&page=1', '2026-02-05', '15:46:28', '127.0.0.1'),
(111, '/shop.php?sort=new&page=2', '2026-02-05', '15:46:33', '127.0.0.1'),
(112, '/shop.php?sort=new&page=3', '2026-02-05', '15:46:34', '127.0.0.1'),
(113, '/shop.php?sort=new&page=4', '2026-02-05', '15:46:37', '127.0.0.1'),
(114, '/shop.php?sort=new&page=4', '2026-02-05', '15:48:34', '127.0.0.1'),
(115, '/shop.php?sort=new&page=1', '2026-02-05', '15:48:36', '127.0.0.1'),
(116, '/shop.php?sort=new&page=4', '2026-02-05', '15:48:38', '127.0.0.1'),
(117, '/shop.php?sort=new&page=4', '2026-02-05', '15:48:47', '127.0.0.1'),
(118, '/shop.php?sort=new&page=4', '2026-02-05', '15:50:09', '127.0.0.1'),
(119, '/shop.php?search=&category_id=&min_price=0&max_price=1000000&style_id=3', '2026-02-05', '15:50:17', '127.0.0.1'),
(120, '/shop.php?search=&category_id=&min_price=0&max_price=1000000&style_id=3', '2026-02-05', '15:51:39', '127.0.0.1'),
(121, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=1&room_id=', '2026-02-05', '15:51:44', '127.0.0.1'),
(122, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=5&room_id=', '2026-02-05', '15:51:48', '127.0.0.1'),
(123, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=5&room_id=&color_ids%5B%5D=2', '2026-02-05', '15:51:55', '127.0.0.1'),
(124, '/shop.php', '2026-02-05', '15:51:58', '127.0.0.1'),
(125, '/shop.php?page=4', '2026-02-05', '15:52:05', '127.0.0.1'),
(126, '/shop.php?page=4', '2026-02-05', '15:53:37', '127.0.0.1'),
(127, '/shop.php?page=1', '2026-02-05', '15:53:46', '127.0.0.1'),
(128, '/index.php', '2026-02-05', '15:53:58', '127.0.0.1'),
(129, '/shop.php', '2026-02-05', '15:55:18', '127.0.0.1'),
(130, '/product.php?id=27', '2026-02-05', '15:56:02', '127.0.0.1'),
(131, '/shop.php', '2026-02-05', '15:56:15', '127.0.0.1'),
(132, '/product.php?id=26', '2026-02-05', '15:56:18', '127.0.0.1'),
(133, '/product.php?id=26', '2026-02-05', '15:57:54', '127.0.0.1'),
(134, '/index.php', '2026-02-05', '15:58:11', '127.0.0.1'),
(135, '/profile.php', '2026-02-05', '15:58:26', '127.0.0.1'),
(136, '/profile.php', '2026-02-05', '16:00:21', '127.0.0.1'),
(137, '/profile.php', '2026-02-05', '16:01:13', '127.0.0.1'),
(138, '/product.php?id=5', '2026-02-05', '16:01:24', '127.0.0.1'),
(139, '/profile.php', '2026-02-05', '16:01:27', '127.0.0.1'),
(140, '/shop.php?search=%D0%BD%D0%BE%D1%80%D0%B4%D0%B8%D0%BA', '2026-02-05', '16:01:31', '127.0.0.1'),
(141, '/shop.php', '2026-02-05', '16:01:41', '127.0.0.1'),
(142, '/shop.php', '2026-02-05', '16:02:26', '127.0.0.1'),
(143, '/cart.php', '2026-02-05', '16:02:32', '127.0.0.1'),
(144, '/shop.php', '2026-02-05', '16:02:34', '127.0.0.1'),
(145, '/shop.php', '2026-02-05', '16:06:53', '127.0.0.1'),
(146, '/shop.php', '2026-02-05', '16:07:00', '127.0.0.1'),
(147, '/shop.php', '2026-02-05', '16:10:35', '127.0.0.1'),
(148, '/index.php', '2026-02-05', '16:10:50', '127.0.0.1'),
(149, '/index.php', '2026-02-05', '16:13:32', '127.0.0.1'),
(150, '/shop.php', '2026-02-05', '16:13:33', '127.0.0.1'),
(151, '/shop.php', '2026-02-05', '16:14:59', '127.0.0.1'),
(152, '/cart.php', '2026-02-05', '16:15:02', '127.0.0.1'),
(153, '/checkout.php', '2026-02-05', '16:15:06', '127.0.0.1'),
(154, '/checkout.php', '2026-02-05', '16:15:09', '127.0.0.1'),
(155, '/profile.php?order_success=1', '2026-02-05', '16:15:09', '127.0.0.1'),
(156, '/shop.php', '2026-02-05', '16:15:22', '127.0.0.1'),
(157, '/shop.php', '2026-02-05', '16:17:46', '127.0.0.1'),
(158, '/cart.php', '2026-02-05', '16:18:23', '127.0.0.1'),
(159, '/shop.php', '2026-02-05', '16:18:26', '127.0.0.1'),
(160, '/shop.php', '2026-02-05', '16:20:14', '127.0.0.1'),
(161, '/shop.php', '2026-02-05', '16:20:56', '127.0.0.1'),
(162, '/shop.php', '2026-02-05', '16:21:02', '127.0.0.1'),
(163, '/index.php', '2026-02-05', '16:21:03', '127.0.0.1'),
(164, '/index.php', '2026-02-05', '16:22:19', '127.0.0.1'),
(165, '/shop.php', '2026-02-05', '16:22:43', '127.0.0.1'),
(166, '/cart.php', '2026-02-05', '16:22:49', '127.0.0.1'),
(167, '/index.php', '2026-02-05', '16:22:53', '127.0.0.1'),
(168, '/cart.php', '2026-02-05', '16:22:59', '127.0.0.1'),
(169, '/cart.php', '2026-02-05', '16:23:03', '127.0.0.1'),
(170, '/profile.php', '2026-02-05', '16:23:05', '127.0.0.1'),
(171, '/profile.php', '2026-02-05', '16:23:09', '127.0.0.1'),
(172, '/cart.php', '2026-02-05', '16:23:11', '127.0.0.1'),
(173, '/checkout.php', '2026-02-05', '16:23:16', '127.0.0.1'),
(174, '/checkout.php', '2026-02-05', '16:23:46', '127.0.0.1'),
(175, '/profile.php?order_success=1', '2026-02-05', '16:23:46', '127.0.0.1'),
(176, '/shop.php', '2026-02-05', '16:24:08', '127.0.0.1'),
(177, '/shop.php?category_id=14&min_price=0&max_price=1000000&room_id=', '2026-02-05', '16:24:10', '127.0.0.1'),
(178, '/shop.php?category_id=&min_price=0&max_price=1000000&room_id=', '2026-02-05', '16:24:12', '127.0.0.1'),
(179, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=8&room_id=', '2026-02-05', '16:24:16', '127.0.0.1'),
(180, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=3&room_id=', '2026-02-05', '16:24:18', '127.0.0.1'),
(181, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=3&room_id=&color_ids%5B%5D=18&color_ids%5B%5D=14', '2026-02-05', '16:24:23', '127.0.0.1'),
(182, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=3&room_id=&color_ids%5B%5D=14', '2026-02-05', '16:24:25', '127.0.0.1'),
(183, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=3&room_id=&color_ids%5B%5D=14', '2026-02-05', '16:24:26', '127.0.0.1'),
(184, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=3&room_id=&color_ids%5B%5D=2', '2026-02-05', '16:24:29', '127.0.0.1'),
(185, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=3&room_id=&color_ids%5B%5D=2&color_ids%5B%5D=10', '2026-02-05', '16:24:31', '127.0.0.1'),
(186, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=2&room_id=', '2026-02-05', '16:24:37', '127.0.0.1'),
(187, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=2&room_id=&material_ids%5B%5D=3', '2026-02-05', '16:24:39', '127.0.0.1'),
(188, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=2&room_id=&material_ids%5B0%5D=3&sort=price_asc&page=1', '2026-02-05', '16:24:42', '127.0.0.1'),
(189, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=2&room_id=&material_ids%5B0%5D=3&sort=price_asc&page=1', '2026-02-05', '16:26:32', '127.0.0.1'),
(190, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=2&room_id=&material_ids%5B0%5D=3&sort=price_asc&page=1', '2026-02-05', '16:26:33', '127.0.0.1'),
(191, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=2&room_id=&material_ids%5B0%5D=3&sort=price_asc&page=1', '2026-02-05', '16:26:34', '127.0.0.1'),
(192, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=2&room_id=&material_ids%5B0%5D=3&sort=price_asc&page=1', '2026-02-05', '16:26:35', '127.0.0.1'),
(193, '/shop.php', '2026-02-05', '16:26:36', '127.0.0.1'),
(194, '/index.php', '2026-02-05', '16:26:38', '127.0.0.1'),
(195, '/index.php', '2026-02-05', '16:30:19', '127.0.0.1'),
(196, '/profile.php', '2026-02-05', '16:30:33', '127.0.0.1'),
(197, '/profile.php', '2026-02-05', '16:42:56', '127.0.0.1'),
(198, '/shop.php', '2026-02-05', '16:42:58', '127.0.0.1'),
(199, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=8&room_id=', '2026-02-05', '16:43:02', '127.0.0.1'),
(200, '/shop.php?category_id=&min_price=0&max_price=1000000&style_id=8&room_id=', '2026-02-05', '16:43:12', '127.0.0.1'),
(201, '/index.php', '2026-02-05', '16:43:20', '127.0.0.1'),
(202, '/shop.php', '2026-02-05', '16:43:21', '127.0.0.1'),
(203, '/shop.php', '2026-02-05', '16:44:48', '127.0.0.1'),
(204, '/product.php?id=24', '2026-02-05', '17:09:53', '127.0.0.1'),
(205, '/', '2026-02-05', '17:31:08', '127.0.0.1'),
(206, '/', '2026-02-05', '18:24:40', '127.0.0.1'),
(207, '/', '2026-02-05', '18:26:53', '127.0.0.1'),
(208, '/', '2026-02-05', '18:29:56', '127.0.0.1'),
(209, '/about.php', '2026-02-05', '18:29:56', '127.0.0.1'),
(210, '/shop.php', '2026-02-05', '18:31:06', '127.0.0.1'),
(211, '/shop.php', '2026-02-05', '18:34:48', '127.0.0.1'),
(212, '/shop.php?category_id=&min_price=0&max_price=1000000&style_ids%5B%5D=8&room_id=', '2026-02-05', '18:34:51', '127.0.0.1'),
(213, '/product.php?id=26', '2026-02-05', '18:34:55', '127.0.0.1'),
(214, '/shop.php?category_id=&min_price=0&max_price=1000000&style_ids%5B%5D=8&room_id=', '2026-02-05', '18:34:56', '127.0.0.1'),
(215, '/shop.php?category_id=5&min_price=0&max_price=1000000&room_id=', '2026-02-05', '18:35:02', '127.0.0.1'),
(216, '/profile.php', '2026-02-05', '18:35:11', '127.0.0.1'),
(217, '/about.php', '2026-02-05', '18:35:26', '127.0.0.1'),
(218, '/shop.php', '2026-02-05', '18:35:28', '127.0.0.1'),
(219, '/index.php', '2026-02-05', '18:35:30', '127.0.0.1'),
(220, '/', '2026-02-05', '18:37:31', '127.0.0.1'),
(221, '/profile.php', '2026-02-05', '18:37:39', '127.0.0.1'),
(222, '/shop.php', '2026-02-05', '18:37:41', '127.0.0.1'),
(223, '/shop.php?page=2', '2026-02-05', '18:37:47', '127.0.0.1'),
(224, '/', '2026-02-05', '18:41:03', '127.0.0.1'),
(225, '/cart.php', '2026-02-05', '18:41:09', '127.0.0.1'),
(226, '/checkout.php', '2026-02-05', '18:41:13', '127.0.0.1'),
(227, '/checkout.php', '2026-02-05', '18:41:20', '127.0.0.1'),
(228, '/profile.php?order_success=1', '2026-02-05', '18:41:20', '127.0.0.1'),
(229, '/profile.php?order_success=1', '2026-02-05', '18:41:27', '127.0.0.1'),
(230, '/', '2026-02-05', '18:51:24', '127.0.0.1'),
(231, '/shop.php', '2026-02-05', '18:51:47', '127.0.0.1'),
(232, '/about.php', '2026-02-05', '18:51:52', '127.0.0.1'),
(233, '/profile.php', '2026-02-05', '18:51:56', '127.0.0.1'),
(234, '/index.php', '2026-02-05', '18:52:08', '127.0.0.1'),
(235, '/shop.php', '2026-02-05', '18:52:09', '127.0.0.1'),
(236, '/cart.php', '2026-02-05', '18:52:17', '127.0.0.1'),
(237, '/login.php', '2026-02-05', '18:52:20', '127.0.0.1'),
(238, '/register.php', '2026-02-05', '18:52:24', '127.0.0.1'),
(239, '/index.php', '2026-02-05', '18:52:39', '127.0.0.1'),
(240, '/about.php', '2026-02-05', '18:54:37', '127.0.0.1'),
(241, '/shop.php', '2026-02-05', '18:54:55', '127.0.0.1'),
(242, '/shop.php?page=2', '2026-02-05', '18:54:58', '127.0.0.1'),
(243, '/shop.php?page=3', '2026-02-05', '18:54:59', '127.0.0.1'),
(244, '/shop.php?page=4', '2026-02-05', '18:55:01', '127.0.0.1'),
(245, '/shop.php?page=1', '2026-02-05', '18:55:03', '127.0.0.1'),
(246, '/shop.php?page=4', '2026-02-05', '18:55:17', '127.0.0.1'),
(247, '/product.php?id=5', '2026-02-05', '18:55:22', '127.0.0.1'),
(248, '/cart.php', '2026-02-05', '18:55:38', '127.0.0.1'),
(249, '/index.php', '2026-02-05', '18:55:42', '127.0.0.1'),
(250, '/shop.php', '2026-02-05', '18:55:47', '127.0.0.1'),
(251, '/product.php?id=24', '2026-02-05', '18:55:53', '127.0.0.1'),
(252, '/cart.php', '2026-02-05', '18:56:00', '127.0.0.1'),
(253, '/cart.php', '2026-02-05', '18:56:04', '127.0.0.1'),
(254, '/login.php', '2026-02-05', '18:56:10', '127.0.0.1'),
(255, '/register.php', '2026-02-05', '18:56:12', '127.0.0.1'),
(256, '/register.php', '2026-02-05', '18:56:47', '127.0.0.1'),
(257, '/profile.php', '2026-02-05', '18:56:47', '127.0.0.1'),
(258, '/cart.php', '2026-02-05', '18:57:08', '127.0.0.1'),
(259, '/checkout.php', '2026-02-05', '18:57:11', '127.0.0.1'),
(260, '/profile.php?edit=phone', '2026-02-05', '18:57:11', '127.0.0.1'),
(261, '/profile.php?edit=phone', '2026-02-05', '18:57:24', '127.0.0.1'),
(262, '/profile.php?edit=phone', '2026-02-05', '18:57:38', '127.0.0.1'),
(263, '/profile.php?edit=phone', '2026-02-05', '18:57:55', '127.0.0.1'),
(264, '/profile.php?edit=phone', '2026-02-05', '18:57:59', '127.0.0.1'),
(265, '/profile.php?edit=phone', '2026-02-05', '18:58:02', '127.0.0.1'),
(266, '/profile.php', '2026-02-05', '18:58:05', '127.0.0.1'),
(267, '/cart.php', '2026-02-05', '18:58:12', '127.0.0.1'),
(268, '/checkout.php', '2026-02-05', '18:58:14', '127.0.0.1'),
(269, '/checkout.php', '2026-02-05', '18:58:46', '127.0.0.1'),
(270, '/profile.php?order_success=1', '2026-02-05', '18:58:46', '127.0.0.1'),
(271, '/shop.php', '2026-02-05', '18:58:54', '127.0.0.1'),
(272, '/profile.php', '2026-02-05', '18:58:58', '127.0.0.1'),
(273, '/index.php', '2026-02-05', '18:59:09', '127.0.0.1'),
(274, '/login.php', '2026-02-05', '18:59:10', '127.0.0.1'),
(275, '/login.php', '2026-02-05', '18:59:13', '127.0.0.1'),
(276, '/profile.php', '2026-02-05', '18:59:13', '127.0.0.1'),
(277, '/', '2026-02-05', '19:02:07', '127.0.0.1'),
(278, '/product.php?id=11', '2026-02-05', '19:02:36', '127.0.0.1'),
(279, '/product.php?id=9', '2026-02-05', '19:02:48', '127.0.0.1'),
(280, '/product.php?id=24', '2026-02-05', '19:02:54', '127.0.0.1'),
(281, '/product.php?id=16', '2026-02-05', '19:02:55', '127.0.0.1'),
(282, '/shop.php', '2026-02-05', '19:02:59', '127.0.0.1'),
(283, '/cart.php', '2026-02-05', '19:03:04', '127.0.0.1'),
(284, '/shop.php', '2026-02-05', '19:03:07', '127.0.0.1'),
(285, '/cart.php', '2026-02-05', '19:03:10', '127.0.0.1'),
(286, '/checkout.php', '2026-02-05', '19:03:33', '127.0.0.1'),
(287, '/checkout.php', '2026-02-05', '19:03:36', '127.0.0.1'),
(288, '/profile.php?order_success=1', '2026-02-05', '19:03:36', '127.0.0.1'),
(289, '/index.php', '2026-02-05', '19:04:39', '127.0.0.1'),
(290, '/login.php', '2026-02-05', '19:04:40', '127.0.0.1'),
(291, '/login.php', '2026-02-05', '19:04:43', '127.0.0.1'),
(292, '/profile.php', '2026-02-05', '19:04:43', '127.0.0.1'),
(293, '/profile.php', '2026-02-05', '19:05:30', '127.0.0.1'),
(294, '/profile.php', '2026-02-05', '19:05:41', '127.0.0.1'),
(295, '/profile.php', '2026-02-05', '19:05:47', '127.0.0.1'),
(296, '/index.php', '2026-02-05', '19:05:51', '127.0.0.1'),
(297, '/login.php', '2026-02-05', '19:05:52', '127.0.0.1'),
(298, '/login.php', '2026-02-05', '19:05:55', '127.0.0.1'),
(299, '/register.php', '2026-02-05', '19:05:57', '127.0.0.1'),
(300, '/register.php', '2026-02-05', '19:06:06', '127.0.0.1'),
(301, '/profile.php', '2026-02-05', '19:06:06', '127.0.0.1'),
(302, '/profile.php', '2026-02-05', '19:06:18', '127.0.0.1'),
(303, '/shop.php', '2026-02-05', '19:06:30', '127.0.0.1'),
(304, '/cart.php', '2026-02-05', '19:06:34', '127.0.0.1'),
(305, '/checkout.php', '2026-02-05', '19:06:38', '127.0.0.1'),
(306, '/profile.php?edit=phone', '2026-02-05', '19:06:38', '127.0.0.1'),
(307, '/profile.php?edit=phone', '2026-02-05', '19:06:59', '127.0.0.1'),
(308, '/profile.php?edit=phone', '2026-02-05', '19:07:02', '127.0.0.1'),
(309, '/profile.php?edit=phone', '2026-02-05', '19:07:06', '127.0.0.1'),
(310, '/profile.php', '2026-02-05', '19:07:09', '127.0.0.1'),
(311, '/index.php', '2026-02-05', '19:07:32', '127.0.0.1'),
(312, '/login.php', '2026-02-05', '19:07:33', '127.0.0.1'),
(313, '/login.php', '2026-02-05', '19:07:35', '127.0.0.1'),
(314, '/profile.php', '2026-02-05', '19:07:36', '127.0.0.1'),
(315, '/profile.php', '2026-02-05', '19:09:32', '127.0.0.1'),
(316, '/profile.php', '2026-02-05', '19:09:58', '127.0.0.1'),
(317, '/shop.php', '2026-02-05', '19:10:00', '127.0.0.1'),
(318, '/cart.php', '2026-02-05', '19:10:04', '127.0.0.1'),
(319, '/checkout.php', '2026-02-05', '19:10:05', '127.0.0.1'),
(320, '/profile.php?edit=phone', '2026-02-05', '19:10:06', '127.0.0.1'),
(321, '/profile.php?edit=phone', '2026-02-05', '19:15:07', '127.0.0.1'),
(322, '/profile.php?edit=phone', '2026-02-05', '19:16:26', '127.0.0.1'),
(323, '/profile.php?edit=phone', '2026-02-05', '19:16:33', '127.0.0.1'),
(324, '/profile.php?edit=phone', '2026-02-05', '19:17:00', '127.0.0.1'),
(325, '/profile.php?edit=phone', '2026-02-05', '19:18:01', '127.0.0.1'),
(326, '/profile.php?edit=phone', '2026-02-05', '19:19:35', '127.0.0.1'),
(327, '/profile.php?edit=phone', '2026-02-05', '19:25:22', '127.0.0.1'),
(328, '/profile.php?edit=phone', '2026-02-05', '19:27:34', '127.0.0.1'),
(329, '/profile.php?edit=phone', '2026-02-05', '19:27:43', '127.0.0.1'),
(330, '/profile.php?edit=phone', '2026-02-05', '19:31:04', '127.0.0.1'),
(331, '/profile.php', '2026-02-05', '19:31:08', '127.0.0.1'),
(332, '/shop.php', '2026-02-05', '19:31:18', '127.0.0.1'),
(333, '/product.php?id=26', '2026-02-05', '19:31:20', '127.0.0.1'),
(334, '/product.php?id=26', '2026-02-05', '19:35:52', '127.0.0.1'),
(335, '/product.php?id=26', '2026-02-05', '19:35:56', '127.0.0.1'),
(336, '/product.php?id=26', '2026-02-05', '19:37:39', '127.0.0.1'),
(337, '/product.php?id=26', '2026-02-05', '19:38:04', '127.0.0.1'),
(338, '/product.php?id=26', '2026-02-05', '19:42:29', '127.0.0.1'),
(339, '/shop.php', '2026-02-05', '19:42:48', '127.0.0.1'),
(340, '/cart.php', '2026-02-05', '19:42:58', '127.0.0.1'),
(341, '/cart.php', '2026-02-05', '19:45:35', '127.0.0.1'),
(342, '/checkout.php', '2026-02-05', '19:45:42', '127.0.0.1'),
(343, '/checkout.php', '2026-02-05', '19:47:05', '127.0.0.1'),
(344, '/profile.php', '2026-02-05', '19:47:12', '127.0.0.1'),
(345, '/cart.php', '2026-02-05', '19:47:22', '127.0.0.1'),
(346, '/checkout.php', '2026-02-05', '19:47:24', '127.0.0.1'),
(347, '/checkout.php', '2026-02-05', '19:47:26', '127.0.0.1'),
(348, '/profile.php?order_success=1', '2026-02-05', '19:47:26', '127.0.0.1'),
(349, '/profile.php?order_success=1', '2026-02-05', '19:50:39', '127.0.0.1'),
(350, '/shop.php', '2026-02-05', '19:50:45', '127.0.0.1'),
(351, '/profile.php', '2026-02-05', '19:50:48', '127.0.0.1'),
(352, '/product.php?id=21', '2026-02-05', '19:50:51', '127.0.0.1'),
(353, '/product.php?id=21', '2026-02-05', '19:52:06', '127.0.0.1'),
(354, '/profile.php', '2026-02-05', '19:52:12', '127.0.0.1'),
(355, '/index.php', '2026-02-05', '19:52:14', '127.0.0.1'),
(356, '/login.php', '2026-02-05', '19:52:17', '127.0.0.1'),
(357, '/login.php', '2026-02-05', '19:52:20', '127.0.0.1'),
(358, '/profile.php', '2026-02-05', '19:52:20', '127.0.0.1'),
(359, '/profile.php', '2026-02-05', '19:53:06', '127.0.0.1'),
(360, '/login.php', '2026-02-05', '19:53:08', '127.0.0.1'),
(361, '/index.php', '2026-02-05', '19:53:09', '127.0.0.1'),
(362, '/profile.php', '2026-02-05', '19:53:11', '127.0.0.1'),
(363, '/product.php?id=21', '2026-02-05', '19:53:12', '127.0.0.1'),
(364, '/', '2026-02-06', '12:07:22', '127.0.0.1'),
(365, '/shop.php', '2026-02-06', '12:07:39', '127.0.0.1'),
(366, '/login.php', '2026-02-06', '12:08:00', '127.0.0.1'),
(367, '/shop.php', '2026-02-06', '12:08:03', '127.0.0.1'),
(368, '/shop.php?page=2', '2026-02-06', '12:08:07', '127.0.0.1'),
(369, '/shop.php?page=3', '2026-02-06', '12:08:08', '127.0.0.1'),
(370, '/shop.php?page=4', '2026-02-06', '12:08:08', '127.0.0.1'),
(371, '/shop.php?page=3', '2026-02-06', '12:08:12', '127.0.0.1'),
(372, '/shop.php?page=2', '2026-02-06', '12:08:15', '127.0.0.1'),
(373, '/shop.php?page=1', '2026-02-06', '12:08:17', '127.0.0.1'),
(374, '/shop.php?page=2', '2026-02-06', '12:08:23', '127.0.0.1'),
(375, '/shop.php?page=3', '2026-02-06', '12:08:24', '127.0.0.1'),
(376, '/shop.php?page=4', '2026-02-06', '12:08:49', '127.0.0.1'),
(377, '/shop.php?page=1', '2026-02-06', '12:09:51', '127.0.0.1'),
(378, '/login.php', '2026-02-06', '12:10:07', '127.0.0.1'),
(379, '/login.php', '2026-02-06', '12:10:11', '127.0.0.1'),
(380, '/profile.php', '2026-02-06', '12:10:12', '127.0.0.1'),
(381, '/profile.php', '2026-02-06', '12:11:02', '127.0.0.1'),
(382, '/profile.php', '2026-02-06', '12:11:16', '127.0.0.1'),
(383, '/profile.php', '2026-02-06', '12:11:44', '127.0.0.1'),
(384, '/', '2026-02-06', '12:36:00', '127.0.0.1'),
(385, '/', '2026-02-06', '12:43:27', '127.0.0.1'),
(386, '/shop.php', '2026-02-06', '12:43:30', '127.0.0.1'),
(387, '/shop.php?page=2', '2026-02-06', '12:43:37', '127.0.0.1'),
(388, '/shop.php?page=3', '2026-02-06', '12:43:38', '127.0.0.1'),
(389, '/shop.php?page=2', '2026-02-06', '12:43:40', '127.0.0.1'),
(390, '/shop.php?page=4', '2026-02-06', '12:43:42', '127.0.0.1'),
(391, '/shop.php?page=1', '2026-02-06', '12:43:44', '127.0.0.1'),
(392, '/product.php?id=21', '2026-02-06', '12:43:47', '127.0.0.1'),
(393, '/product.php?id=21', '2026-02-06', '12:43:56', '127.0.0.1'),
(394, '/product.php?id=21', '2026-02-06', '12:43:56', '127.0.0.1'),
(395, '/product.php?id=21', '2026-02-06', '12:43:57', '127.0.0.1'),
(396, '/product.php?id=12', '2026-02-06', '12:44:28', '127.0.0.1'),
(397, '/product.php?id=12', '2026-02-06', '12:44:36', '127.0.0.1'),
(398, '/product.php?id=12', '2026-02-06', '12:44:46', '127.0.0.1'),
(399, '/shop.php', '2026-02-06', '12:44:49', '127.0.0.1'),
(400, '/shop.php?category_id=7&min_price=0&max_price=1000000&room_id=', '2026-02-06', '12:44:51', '127.0.0.1'),
(401, '/product.php?id=7', '2026-02-06', '12:44:55', '127.0.0.1'),
(402, '/product.php?id=7', '2026-02-06', '12:44:59', '127.0.0.1'),
(403, '/product.php?id=7', '2026-02-06', '12:45:13', '127.0.0.1'),
(404, '/product.php?id=14', '2026-02-06', '12:45:15', '127.0.0.1'),
(405, '/product.php?id=19', '2026-02-06', '12:45:18', '127.0.0.1'),
(406, '/product.php?id=19', '2026-02-06', '12:49:33', '127.0.0.1'),
(407, '/shop.php', '2026-02-06', '12:49:42', '127.0.0.1'),
(408, '/shop.php?category_id=7&min_price=0&max_price=1000000&room_id=', '2026-02-06', '12:49:46', '127.0.0.1'),
(409, '/product.php?id=7', '2026-02-06', '12:49:47', '127.0.0.1'),
(410, '/shop.php?category_id=7&min_price=0&max_price=1000000&room_id=', '2026-02-06', '12:49:56', '127.0.0.1'),
(411, '/shop.php?category_id=10&min_price=0&max_price=1000000&room_id=', '2026-02-06', '12:50:00', '127.0.0.1'),
(412, '/shop.php?category_id=14&min_price=0&max_price=1000000&room_id=', '2026-02-06', '12:50:03', '127.0.0.1'),
(413, '/product.php?id=21', '2026-02-06', '12:50:04', '127.0.0.1'),
(414, '/shop.php?category_id=14&min_price=0&max_price=1000000&room_id=', '2026-02-06', '12:50:07', '127.0.0.1'),
(415, '/shop.php?category_id=14&min_price=0&max_price=1000000&room_id=', '2026-02-06', '12:51:41', '127.0.0.1'),
(416, '/product.php?id=21', '2026-02-06', '12:51:43', '127.0.0.1'),
(417, '/shop.php?category_id=14&min_price=0&max_price=1000000&room_id=', '2026-02-06', '12:51:47', '127.0.0.1'),
(418, '/shop.php?category_id=8&min_price=0&max_price=1000000&room_id=', '2026-02-06', '12:51:49', '127.0.0.1'),
(419, '/product.php?id=16', '2026-02-06', '12:51:50', '127.0.0.1'),
(420, '/shop.php?category_id=8&min_price=0&max_price=1000000&room_id=', '2026-02-06', '12:51:56', '127.0.0.1'),
(421, '/shop.php?category_id=7&min_price=0&max_price=1000000&room_id=', '2026-02-06', '12:52:00', '127.0.0.1'),
(422, '/product.php?id=23', '2026-02-06', '12:52:01', '127.0.0.1'),
(423, '/shop.php?category_id=7&min_price=0&max_price=1000000&room_id=', '2026-02-06', '12:52:06', '127.0.0.1'),
(424, '/shop.php?category_id=&min_price=0&max_price=1000000&room_id=2', '2026-02-06', '12:52:33', '127.0.0.1'),
(425, '/shop.php?category_id=&min_price=0&max_price=1000000&room_id=2', '2026-02-06', '12:52:34', '127.0.0.1'),
(426, '/product.php?id=15', '2026-02-06', '12:52:41', '127.0.0.1'),
(427, '/shop.php', '2026-02-06', '12:52:50', '127.0.0.1'),
(428, '/shop.php?page=2', '2026-02-06', '12:52:55', '127.0.0.1'),
(429, '/shop.php?page=1', '2026-02-06', '12:52:58', '127.0.0.1'),
(430, '/shop.php?page=1', '2026-02-06', '12:55:05', '127.0.0.1'),
(431, '/shop.php?page=1', '2026-02-06', '12:56:11', '127.0.0.1'),
(432, '/shop.php?page=2', '2026-02-06', '12:56:12', '127.0.0.1'),
(433, '/shop.php?page=3', '2026-02-06', '12:56:15', '127.0.0.1'),
(434, '/shop.php?page=4', '2026-02-06', '12:56:18', '127.0.0.1'),
(435, '/product.php?id=5', '2026-02-06', '12:56:21', '127.0.0.1'),
(436, '/product.php?id=19', '2026-02-06', '12:57:10', '127.0.0.1'),
(437, '/product.php?id=7', '2026-02-06', '12:57:56', '127.0.0.1'),
(438, '/product.php?id=7', '2026-02-06', '12:59:55', '127.0.0.1'),
(439, '/shop.php', '2026-02-06', '13:01:03', '127.0.0.1'),
(440, '/index.php', '2026-02-06', '13:01:06', '127.0.0.1'),
(441, '/shop.php', '2026-02-06', '13:01:12', '127.0.0.1'),
(442, '/cart.php', '2026-02-06', '13:01:19', '127.0.0.1'),
(443, '/cart.php', '2026-02-06', '13:05:09', '127.0.0.1'),
(444, '/cart.php', '2026-02-06', '13:05:51', '127.0.0.1'),
(445, '/cart.php', '2026-02-06', '13:06:11', '127.0.0.1'),
(446, '/cart.php', '2026-02-06', '13:06:24', '127.0.0.1'),
(447, '/cart.php', '2026-02-06', '13:07:33', '127.0.0.1'),
(448, '/cart.php', '2026-02-06', '13:07:38', '127.0.0.1'),
(449, '/cart.php', '2026-02-06', '13:07:49', '127.0.0.1'),
(450, '/cart.php', '2026-02-06', '13:07:55', '127.0.0.1'),
(451, '/index.php', '2026-02-06', '13:08:36', '127.0.0.1'),
(452, '/cart.php', '2026-02-06', '13:11:16', '127.0.0.1'),
(453, '/cart.php', '2026-02-06', '13:12:09', '127.0.0.1'),
(454, '/cart.php', '2026-02-06', '13:12:10', '127.0.0.1'),
(455, '/cart.php', '2026-02-06', '13:12:11', '127.0.0.1'),
(456, '/cart.php', '2026-02-06', '13:12:12', '127.0.0.1'),
(457, '/cart.php', '2026-02-06', '13:12:13', '127.0.0.1'),
(458, '/cart.php', '2026-02-06', '13:12:13', '127.0.0.1'),
(459, '/cart.php', '2026-02-06', '13:12:14', '127.0.0.1'),
(460, '/cart.php', '2026-02-06', '13:12:15', '127.0.0.1'),
(461, '/cart.php', '2026-02-06', '13:12:15', '127.0.0.1'),
(462, '/cart.php', '2026-02-06', '13:12:16', '127.0.0.1'),
(463, '/cart.php', '2026-02-06', '13:12:17', '127.0.0.1'),
(464, '/cart.php', '2026-02-06', '13:12:17', '127.0.0.1'),
(465, '/cart.php', '2026-02-06', '13:12:18', '127.0.0.1'),
(466, '/cart.php', '2026-02-06', '13:12:19', '127.0.0.1'),
(467, '/cart.php', '2026-02-06', '13:12:20', '127.0.0.1'),
(468, '/cart.php', '2026-02-06', '13:12:20', '127.0.0.1'),
(469, '/shop.php', '2026-02-06', '13:12:23', '127.0.0.1'),
(470, '/shop.php?page=4', '2026-02-06', '13:12:27', '127.0.0.1'),
(471, '/cart.php', '2026-02-06', '13:12:33', '127.0.0.1'),
(472, '/cart.php', '2026-02-06', '13:12:34', '127.0.0.1'),
(473, '/cart.php', '2026-02-06', '13:12:40', '127.0.0.1'),
(474, '/cart.php', '2026-02-06', '13:12:43', '127.0.0.1'),
(475, '/cart.php', '2026-02-06', '13:12:44', '127.0.0.1'),
(476, '/cart.php', '2026-02-06', '13:12:45', '127.0.0.1'),
(477, '/cart.php', '2026-02-06', '13:12:49', '127.0.0.1'),
(478, '/cart.php', '2026-02-06', '13:14:45', '127.0.0.1'),
(479, '/cart.php', '2026-02-06', '13:14:48', '127.0.0.1'),
(480, '/cart.php', '2026-02-06', '13:17:05', '127.0.0.1'),
(481, '/cart.php', '2026-02-06', '13:17:08', '127.0.0.1'),
(482, '/cart.php', '2026-02-06', '13:17:11', '127.0.0.1'),
(483, '/cart.php', '2026-02-06', '13:17:14', '127.0.0.1'),
(484, '/cart.php', '2026-02-06', '13:17:16', '127.0.0.1'),
(485, '/cart.php', '2026-02-06', '13:17:17', '127.0.0.1'),
(486, '/cart.php', '2026-02-06', '13:17:21', '127.0.0.1'),
(487, '/cart.php', '2026-02-06', '13:17:23', '127.0.0.1'),
(488, '/cart.php', '2026-02-06', '13:17:26', '127.0.0.1'),
(489, '/shop.php', '2026-02-06', '13:17:28', '127.0.0.1'),
(490, '/shop.php?page=4', '2026-02-06', '13:17:30', '127.0.0.1'),
(491, '/shop.php?page=3', '2026-02-06', '13:17:39', '127.0.0.1'),
(492, '/shop.php?page=2', '2026-02-06', '13:17:48', '127.0.0.1'),
(493, '/cart.php', '2026-02-06', '13:17:54', '127.0.0.1'),
(494, '/cart.php', '2026-02-06', '13:18:09', '127.0.0.1'),
(495, '/cart.php', '2026-02-06', '13:20:20', '127.0.0.1'),
(496, '/cart.php', '2026-02-06', '13:20:22', '127.0.0.1'),
(497, '/cart.php', '2026-02-06', '13:20:24', '127.0.0.1'),
(498, '/cart.php', '2026-02-06', '13:22:19', '127.0.0.1'),
(499, '/cart.php', '2026-02-06', '13:24:19', '127.0.0.1'),
(500, '/cart.php', '2026-02-06', '13:24:20', '127.0.0.1'),
(501, '/cart.php', '2026-02-06', '13:24:22', '127.0.0.1'),
(502, '/cart.php', '2026-02-06', '13:24:23', '127.0.0.1'),
(503, '/cart.php', '2026-02-06', '13:24:24', '127.0.0.1'),
(504, '/cart.php', '2026-02-06', '13:24:25', '127.0.0.1'),
(505, '/cart.php', '2026-02-06', '13:24:26', '127.0.0.1'),
(506, '/cart.php', '2026-02-06', '13:25:47', '127.0.0.1'),
(507, '/cart.php', '2026-02-06', '13:25:49', '127.0.0.1'),
(508, '/cart.php', '2026-02-06', '13:25:51', '127.0.0.1'),
(509, '/cart.php', '2026-02-06', '13:25:52', '127.0.0.1'),
(510, '/cart.php', '2026-02-06', '13:25:54', '127.0.0.1'),
(511, '/cart.php', '2026-02-06', '13:25:56', '127.0.0.1'),
(512, '/cart.php', '2026-02-06', '13:25:57', '127.0.0.1'),
(513, '/cart.php', '2026-02-06', '13:25:59', '127.0.0.1'),
(514, '/cart.php', '2026-02-06', '13:26:00', '127.0.0.1'),
(515, '/cart.php', '2026-02-06', '13:26:01', '127.0.0.1'),
(516, '/cart.php', '2026-02-06', '13:26:03', '127.0.0.1'),
(517, '/cart.php', '2026-02-06', '13:26:05', '127.0.0.1'),
(518, '/cart.php', '2026-02-06', '13:26:06', '127.0.0.1'),
(519, '/cart.php', '2026-02-06', '13:26:07', '127.0.0.1'),
(520, '/cart.php', '2026-02-06', '13:26:08', '127.0.0.1'),
(521, '/cart.php', '2026-02-06', '13:26:12', '127.0.0.1'),
(522, '/cart.php', '2026-02-06', '13:26:13', '127.0.0.1'),
(523, '/cart.php', '2026-02-06', '13:26:15', '127.0.0.1'),
(524, '/cart.php', '2026-02-06', '13:26:16', '127.0.0.1'),
(525, '/cart.php', '2026-02-06', '13:26:17', '127.0.0.1'),
(526, '/cart.php', '2026-02-06', '13:26:18', '127.0.0.1'),
(527, '/cart.php', '2026-02-06', '13:26:19', '127.0.0.1'),
(528, '/cart.php', '2026-02-06', '13:28:09', '127.0.0.1'),
(529, '/cart.php', '2026-02-06', '13:28:11', '127.0.0.1'),
(530, '/cart.php', '2026-02-06', '13:28:18', '127.0.0.1'),
(531, '/cart.php', '2026-02-06', '13:28:26', '127.0.0.1'),
(532, '/cart.php', '2026-02-06', '13:29:16', '127.0.0.1'),
(533, '/cart.php', '2026-02-06', '13:29:17', '127.0.0.1'),
(534, '/cart.php', '2026-02-06', '13:29:57', '127.0.0.1'),
(535, '/cart.php', '2026-02-06', '13:29:58', '127.0.0.1'),
(536, '/cart.php', '2026-02-06', '13:29:58', '127.0.0.1'),
(537, '/cart.php', '2026-02-06', '13:30:04', '127.0.0.1'),
(538, '/cart.php', '2026-02-06', '13:32:11', '127.0.0.1'),
(539, '/cart.php', '2026-02-06', '13:32:12', '127.0.0.1'),
(540, '/cart.php', '2026-02-06', '13:32:13', '127.0.0.1'),
(541, '/cart.php', '2026-02-06', '13:32:14', '127.0.0.1'),
(542, '/cart.php', '2026-02-06', '13:32:15', '127.0.0.1'),
(543, '/cart.php', '2026-02-06', '13:32:16', '127.0.0.1'),
(544, '/cart.php', '2026-02-06', '13:32:16', '127.0.0.1'),
(545, '/cart.php', '2026-02-06', '13:32:17', '127.0.0.1'),
(546, '/cart.php', '2026-02-06', '13:32:18', '127.0.0.1'),
(547, '/cart.php', '2026-02-06', '13:32:19', '127.0.0.1'),
(548, '/cart.php', '2026-02-06', '13:32:20', '127.0.0.1'),
(549, '/cart.php', '2026-02-06', '13:33:30', '127.0.0.1'),
(550, '/cart.php', '2026-02-06', '13:33:30', '127.0.0.1'),
(551, '/index.php', '2026-02-06', '13:34:09', '127.0.0.1'),
(552, '/index.php', '2026-02-06', '13:34:13', '127.0.0.1'),
(553, '/index.php', '2026-02-06', '13:34:14', '127.0.0.1'),
(554, '/shop.php', '2026-02-06', '13:34:16', '127.0.0.1'),
(555, '/product.php?id=26', '2026-02-06', '13:34:22', '127.0.0.1'),
(556, '/shop.php', '2026-02-06', '13:34:34', '127.0.0.1'),
(557, '/shop.php?page=4', '2026-02-06', '13:34:35', '127.0.0.1'),
(558, '/shop.php?page=1', '2026-02-06', '13:34:36', '127.0.0.1'),
(559, '/shop.php?page=2', '2026-02-06', '13:34:38', '127.0.0.1'),
(560, '/shop.php?page=3', '2026-02-06', '13:34:38', '127.0.0.1'),
(561, '/shop.php?page=4', '2026-02-06', '13:34:39', '127.0.0.1'),
(562, '/shop.php?page=1', '2026-02-06', '13:34:41', '127.0.0.1'),
(563, '/about.php', '2026-02-06', '13:34:43', '127.0.0.1'),
(564, '/shop.php', '2026-02-06', '13:43:13', '127.0.0.1'),
(565, '/product.php?id=17', '2026-02-06', '13:43:21', '127.0.0.1'),
(566, '/product.php?id=12', '2026-02-06', '13:43:28', '127.0.0.1'),
(567, '/product.php?id=12', '2026-02-06', '13:43:33', '127.0.0.1'),
(568, '/product.php?id=12', '2026-02-06', '13:43:39', '127.0.0.1'),
(569, '/product.php?id=12', '2026-02-06', '13:43:41', '127.0.0.1'),
(570, '/product.php?id=12', '2026-02-06', '13:43:44', '127.0.0.1'),
(571, '/product.php?id=12', '2026-02-06', '13:46:07', '127.0.0.1'),
(572, '/about.php', '2026-02-06', '13:49:15', '127.0.0.1'),
(573, '/shop.php', '2026-02-06', '13:49:19', '127.0.0.1'),
(574, '/shop.php?page=2', '2026-02-06', '13:49:22', '127.0.0.1'),
(575, '/cart.php', '2026-02-06', '13:49:24', '127.0.0.1'),
(576, '/checkout.php', '2026-02-06', '13:49:29', '127.0.0.1'),
(577, '/checkout.php', '2026-02-06', '13:49:31', '127.0.0.1'),
(578, '/profile.php?order_success=1', '2026-02-06', '13:49:32', '127.0.0.1'),
(579, '/profile.php?order_success=1', '2026-02-06', '14:05:41', '127.0.0.1'),
(580, '/cart.php', '2026-02-06', '14:05:46', '127.0.0.1'),
(581, '/cart.php', '2026-02-06', '14:06:20', '127.0.0.1'),
(582, '/cart.php', '2026-02-06', '14:06:58', '127.0.0.1'),
(583, '/cart.php', '2026-02-06', '14:08:15', '127.0.0.1'),
(584, '/cart.php', '2026-02-06', '14:08:19', '127.0.0.1'),
(585, '/cart.php', '2026-02-06', '14:08:22', '127.0.0.1'),
(586, '/index.php', '2026-02-06', '14:21:11', '127.0.0.1'),
(587, '/shop.php', '2026-02-06', '15:02:10', '127.0.0.1'),
(588, '/shop.php', '2026-02-06', '15:04:59', '127.0.0.1'),
(589, '/product.php?id=23', '2026-02-06', '15:05:07', '127.0.0.1'),
(590, '/shop.php', '2026-02-06', '15:05:55', '127.0.0.1'),
(591, '/shop.php', '2026-02-06', '15:05:56', '127.0.0.1'),
(592, '/shop.php', '2026-02-06', '15:05:57', '127.0.0.1'),
(593, '/shop.php', '2026-02-06', '15:08:38', '127.0.0.1'),
(594, '/shop.php', '2026-02-06', '15:09:28', '127.0.0.1'),
(595, '/product.php?id=23', '2026-02-06', '15:09:30', '127.0.0.1'),
(596, '/shop.php', '2026-02-06', '15:10:59', '127.0.0.1'),
(597, '/shop.php?page=4', '2026-02-06', '15:11:02', '127.0.0.1'),
(598, '/shop.php?page=4', '2026-02-06', '15:11:45', '127.0.0.1'),
(599, '/index.php', '2026-02-06', '15:13:17', '127.0.0.1'),
(600, '/index.php', '2026-02-06', '15:13:24', '127.0.0.1'),
(601, '/index.php', '2026-02-06', '15:16:32', '127.0.0.1'),
(602, '/index.php', '2026-02-06', '15:18:45', '127.0.0.1'),
(603, '/shop.php?category_id=1', '2026-02-06', '15:19:00', '127.0.0.1'),
(604, '/shop.php?category_id=&min_price=0&max_price=1000000&style_ids%5B%5D=1&room_id=', '2026-02-06', '15:19:08', '127.0.0.1'),
(605, '/index.php', '2026-02-06', '15:19:16', '127.0.0.1'),
(606, '/shop.php?search=%D0%BB%D0%BE%D1%84%D1%82', '2026-02-06', '15:19:20', '127.0.0.1'),
(607, '/shop.php?search=%D0%BB%D0%BE%D1%84%D1%82', '2026-02-06', '15:19:46', '127.0.0.1'),
(608, '/index.php', '2026-02-06', '15:19:47', '127.0.0.1'),
(609, '/shop.php?search=%D1%81%D0%BA%D0%B0%D0%BD%D0%B4%D0%B8%D0%BD%D0%B0%D0%B2%D1%81%D0%BA%D0%B8%D0%B9', '2026-02-06', '15:19:52', '127.0.0.1'),
(610, '/shop.php?category_id=&min_price=0&max_price=1000000&style_ids%5B%5D=1&room_id=', '2026-02-06', '15:19:55', '127.0.0.1'),
(611, '/shop.php?search=%D1%81%D0%BA%D0%B0%D0%BD%D0%B4%D0%B8%D0%BD%D0%B0%D0%B2%D1%81%D0%BA%D0%B8%D0%B9', '2026-02-06', '15:20:24', '127.0.0.1'),
(612, '/index.php', '2026-02-06', '15:20:26', '127.0.0.1'),
(613, '/shop.php?category_id=&min_price=0', '2026-02-06', '15:20:30', '127.0.0.1'),
(614, '/shop.php?category_id=&min_price=0&max_price=1000000&style_ids%5B%5D=1&room_id=', '2026-02-06', '15:20:34', '127.0.0.1'),
(615, '/index.php', '2026-02-06', '15:20:48', '127.0.0.1'),
(616, '/shop.php?category_id=&min_price=0&max_price=1000000&style_ids%5B%5D=1&room_id=', '2026-02-06', '15:20:51', '127.0.0.1'),
(617, '/index.php', '2026-02-06', '15:21:02', '127.0.0.1'),
(618, '/index.php', '2026-02-06', '15:22:09', '127.0.0.1'),
(619, '/index.php', '2026-02-06', '15:22:19', '127.0.0.1'),
(620, '/index.php', '2026-02-06', '15:24:14', '127.0.0.1'),
(621, '/index.php', '2026-02-06', '15:25:35', '127.0.0.1'),
(622, '/index.php', '2026-02-06', '15:26:08', '127.0.0.1'),
(623, '/index.php', '2026-02-06', '15:26:11', '127.0.0.1'),
(624, '/shop.php?search=%D0%BB%D0%BE%D1%84%D1%82', '2026-02-06', '15:26:14', '127.0.0.1'),
(625, '/index.php', '2026-02-06', '15:26:16', '127.0.0.1'),
(626, '/shop.php', '2026-02-06', '15:26:17', '127.0.0.1'),
(627, '/index.php', '2026-02-06', '15:26:18', '127.0.0.1'),
(628, '/shop.php?category_id=...', '2026-02-06', '15:26:21', '127.0.0.1'),
(629, '/index.php', '2026-02-06', '15:26:24', '127.0.0.1'),
(630, '/shop.php', '2026-02-06', '15:26:27', '127.0.0.1'),
(631, '/shop.php?category_id=&min_price=0&max_price=1000000&style_ids%5B%5D=1&room_id=', '2026-02-06', '15:26:29', '127.0.0.1'),
(632, '/index.php', '2026-02-06', '15:27:51', '127.0.0.1'),
(633, '/shop.php?style_id=1', '2026-02-06', '15:27:55', '127.0.0.1'),
(634, '/shop.php?category_id=&min_price=0&max_price=1000000&style_ids%5B%5D=1&room_id=', '2026-02-06', '15:28:00', '127.0.0.1'),
(635, '/index.php', '2026-02-06', '15:28:13', '127.0.0.1'),
(636, '/shop.php?style_ids%5B%5D=1', '2026-02-06', '15:28:16', '127.0.0.1'),
(637, '/shop.php?category_id=&min_price=0&max_price=1000000&room_id=', '2026-02-06', '15:28:25', '127.0.0.1'),
(638, '/index.php', '2026-02-06', '15:28:31', '127.0.0.1'),
(639, '/index.php', '2026-02-06', '15:29:00', '127.0.0.1'),
(640, '/index.php', '2026-02-06', '15:31:17', '127.0.0.1'),
(641, '/login.php', '2026-02-06', '15:33:20', '127.0.0.1'),
(642, '/login.php', '2026-02-06', '15:33:22', '127.0.0.1'),
(643, '/profile.php', '2026-02-06', '15:33:22', '127.0.0.1'),
(644, '/', '2026-02-06', '15:35:38', '127.0.0.1'),
(645, '/index.php', '2026-02-06', '15:39:28', '127.0.0.1'),
(646, '/index.php', '2026-02-06', '15:40:22', '127.0.0.1'),
(647, '/index.php', '2026-02-06', '15:43:16', '127.0.0.1'),
(648, '/shop.php', '2026-02-06', '15:49:19', '127.0.0.1'),
(649, '/shop.php?page=2', '2026-02-06', '15:49:27', '127.0.0.1'),
(650, '/shop.php?page=3', '2026-02-06', '15:49:28', '127.0.0.1'),
(651, '/shop.php?category_id=&min_price=0&max_price=1000000&style_ids%5B%5D=8&room_id=', '2026-02-06', '15:49:31', '127.0.0.1'),
(652, '/shop.php?category_id=&min_price=0&max_price=1000000&room_id=&color_ids%5B%5D=18&color_ids%5B%5D=19', '2026-02-06', '15:49:35', '127.0.0.1'),
(653, '/shop.php?category_id=&min_price=0&max_price=1000000&room_id=&color_ids%5B%5D=6&color_ids%5B%5D=14', '2026-02-06', '15:49:38', '127.0.0.1'),
(654, '/shop.php?category_id=&min_price=0&max_price=1000000&room_id=', '2026-02-06', '15:49:41', '127.0.0.1'),
(655, '/login.php', '2026-02-06', '15:49:49', '127.0.0.1'),
(656, '/register.php', '2026-02-06', '15:49:53', '127.0.0.1'),
(657, '/register.php', '2026-02-06', '15:50:13', '127.0.0.1'),
(658, '/profile.php', '2026-02-06', '15:50:13', '127.0.0.1'),
(659, '/profile.php', '2026-02-06', '15:50:37', '127.0.0.1'),
(660, '/shop.php', '2026-02-06', '15:50:42', '127.0.0.1'),
(661, '/shop.php?page=4', '2026-02-06', '15:50:45', '127.0.0.1'),
(662, '/product.php?id=5', '2026-02-06', '15:50:54', '127.0.0.1'),
(663, '/cart.php', '2026-02-06', '15:51:12', '127.0.0.1'),
(664, '/checkout.php', '2026-02-06', '15:51:18', '127.0.0.1'),
(665, '/profile.php?edit=phone', '2026-02-06', '15:51:18', '127.0.0.1'),
(666, '/profile.php', '2026-02-06', '15:51:24', '127.0.0.1'),
(667, '/cart.php', '2026-02-06', '15:51:30', '127.0.0.1'),
(668, '/checkout.php', '2026-02-06', '15:51:32', '127.0.0.1'),
(669, '/checkout.php', '2026-02-06', '15:51:38', '127.0.0.1'),
(670, '/profile.php?order_success=1', '2026-02-06', '15:51:38', '127.0.0.1'),
(671, '/about.php', '2026-02-06', '15:51:46', '127.0.0.1'),
(672, '/index.php', '2026-02-06', '15:52:03', '127.0.0.1'),
(673, '/index.php', '2026-02-06', '15:52:10', '127.0.0.1'),
(674, '/login.php', '2026-02-06', '15:52:11', '127.0.0.1'),
(675, '/login.php', '2026-02-06', '15:52:15', '127.0.0.1'),
(676, '/profile.php', '2026-02-06', '15:52:15', '127.0.0.1'),
(677, '/', '2026-02-06', '15:59:04', '127.0.0.1'),
(678, '/shop.php', '2026-02-06', '15:59:05', '127.0.0.1'),
(679, '/product.php?id=26', '2026-02-06', '15:59:07', '127.0.0.1'),
(680, '/product.php?id=26', '2026-02-06', '15:59:28', '127.0.0.1'),
(681, '/product.php?id=26', '2026-02-06', '15:59:33', '127.0.0.1'),
(682, '/product.php?id=26', '2026-02-06', '15:59:34', '127.0.0.1'),
(683, '/product.php?id=26', '2026-02-06', '15:59:34', '127.0.0.1'),
(684, '/product.php?id=26', '2026-02-06', '15:59:37', '127.0.0.1'),
(685, '/product.php?id=26', '2026-02-06', '15:59:38', '127.0.0.1'),
(686, '/product.php?id=26', '2026-02-06', '15:59:39', '127.0.0.1'),
(687, '/product.php?id=26', '2026-02-06', '15:59:42', '127.0.0.1'),
(688, '/product.php?id=26', '2026-02-06', '15:59:43', '127.0.0.1'),
(689, '/cart.php', '2026-02-06', '16:00:04', '127.0.0.1'),
(690, '/cart.php', '2026-02-06', '16:00:12', '127.0.0.1'),
(691, '/cart.php', '2026-02-06', '16:00:12', '127.0.0.1'),
(692, '/cart.php', '2026-02-06', '16:00:13', '127.0.0.1'),
(693, '/cart.php', '2026-02-06', '16:00:13', '127.0.0.1'),
(694, '/cart.php', '2026-02-06', '16:00:15', '127.0.0.1'),
(695, '/cart.php', '2026-02-06', '16:00:15', '127.0.0.1'),
(696, '/cart.php', '2026-02-06', '16:00:16', '127.0.0.1'),
(697, '/cart.php', '2026-02-06', '16:00:17', '127.0.0.1'),
(698, '/cart.php', '2026-02-06', '16:00:26', '127.0.0.1'),
(699, '/cart.php', '2026-02-06', '16:00:27', '127.0.0.1'),
(700, '/cart.php', '2026-02-06', '16:00:32', '127.0.0.1'),
(701, '/cart.php', '2026-02-06', '16:00:33', '127.0.0.1'),
(702, '/cart.php', '2026-02-06', '16:00:37', '127.0.0.1'),
(703, '/shop.php', '2026-02-06', '16:00:39', '127.0.0.1'),
(704, '/shop.php?category_id=7&min_price=0&max_price=1000000&room_id=', '2026-02-06', '16:00:47', '127.0.0.1'),
(705, '/cart.php', '2026-02-06', '16:00:51', '127.0.0.1');
INSERT INTO `visit_logs` (`id`, `page_url`, `visit_date`, `visit_time`, `ip_address`) VALUES
(706, '/cart.php', '2026-02-06', '16:00:57', '127.0.0.1'),
(707, '/cart.php', '2026-02-06', '16:00:58', '127.0.0.1'),
(708, '/cart.php', '2026-02-06', '16:00:59', '127.0.0.1'),
(709, '/cart.php', '2026-02-06', '16:01:00', '127.0.0.1'),
(710, '/cart.php', '2026-02-06', '16:01:01', '127.0.0.1'),
(711, '/cart.php', '2026-02-06', '16:01:01', '127.0.0.1'),
(712, '/cart.php', '2026-02-06', '16:01:02', '127.0.0.1'),
(713, '/index.php', '2026-02-06', '16:01:21', '127.0.0.1'),
(714, '/profile.php', '2026-02-06', '16:01:56', '127.0.0.1'),
(715, '/', '2026-02-06', '16:14:29', '127.0.0.1'),
(716, '/shop.php', '2026-02-06', '16:24:49', '127.0.0.1'),
(717, '/index.php', '2026-02-06', '16:24:54', '127.0.0.1'),
(718, '/shop.php', '2026-02-06', '16:24:56', '127.0.0.1'),
(719, '/shop.php?page=2', '2026-02-06', '16:25:05', '127.0.0.1'),
(720, '/shop.php?page=3', '2026-02-06', '16:25:05', '127.0.0.1'),
(721, '/shop.php?category_id=&min_price=0&max_price=1000000&style_ids%5B%5D=3&room_id=&color_ids%5B%5D=2&material_ids%5B%5D=6', '2026-02-06', '16:25:28', '127.0.0.1'),
(722, '/shop.php?category_id=&min_price=0&max_price=1000000&style_ids%5B%5D=3&room_id=&color_ids%5B%5D=2&material_ids%5B%5D=4', '2026-02-06', '16:25:32', '127.0.0.1'),
(723, '/shop.php?category_id=&min_price=0&max_price=1000000&style_ids%5B%5D=3&room_id=&color_ids%5B%5D=2&color_ids%5B%5D=6&material_ids%5B%5D=4', '2026-02-06', '16:25:34', '127.0.0.1'),
(724, '/shop.php?category_id=&min_price=0&max_price=1000000&style_ids%5B%5D=3&room_id=&color_ids%5B%5D=2&color_ids%5B%5D=10&color_ids%5B%5D=13&color_ids%5B%5D=6&material_ids%5B%5D=4', '2026-02-06', '16:25:37', '127.0.0.1'),
(725, '/login.php', '2026-02-06', '16:25:47', '127.0.0.1'),
(726, '/register.php', '2026-02-06', '16:25:51', '127.0.0.1'),
(727, '/register.php', '2026-02-06', '16:26:08', '127.0.0.1'),
(728, '/register.php', '2026-02-06', '16:26:13', '127.0.0.1'),
(729, '/profile.php', '2026-02-06', '16:26:13', '127.0.0.1'),
(730, '/profile.php', '2026-02-06', '16:26:32', '127.0.0.1'),
(731, '/shop.php', '2026-02-06', '16:26:45', '127.0.0.1'),
(732, '/product.php?id=5', '2026-02-06', '16:27:00', '127.0.0.1'),
(733, '/cart.php', '2026-02-06', '16:27:15', '127.0.0.1'),
(734, '/shop.php', '2026-02-06', '16:27:30', '127.0.0.1'),
(735, '/product.php?id=5', '2026-02-06', '16:27:34', '127.0.0.1'),
(736, '/product.php?id=5', '2026-02-06', '16:28:02', '127.0.0.1'),
(737, '/product.php?id=5', '2026-02-06', '16:28:03', '127.0.0.1'),
(738, '/product.php?id=5', '2026-02-06', '16:28:05', '127.0.0.1'),
(739, '/cart.php', '2026-02-06', '16:28:11', '127.0.0.1'),
(740, '/cart.php', '2026-02-06', '16:28:12', '127.0.0.1'),
(741, '/checkout.php', '2026-02-06', '16:28:16', '127.0.0.1'),
(742, '/profile.php?edit=phone', '2026-02-06', '16:28:16', '127.0.0.1'),
(743, '/profile.php', '2026-02-06', '16:28:22', '127.0.0.1'),
(744, '/cart.php', '2026-02-06', '16:28:27', '127.0.0.1'),
(745, '/checkout.php', '2026-02-06', '16:28:29', '127.0.0.1'),
(746, '/checkout.php', '2026-02-06', '16:28:35', '127.0.0.1'),
(747, '/profile.php?order_success=1', '2026-02-06', '16:28:35', '127.0.0.1'),
(748, '/about.php', '2026-02-06', '16:28:45', '127.0.0.1'),
(749, '/shop.php', '2026-02-06', '16:29:20', '127.0.0.1'),
(750, '/shop.php?sort=price_asc&page=1', '2026-02-06', '16:29:22', '127.0.0.1'),
(751, '/shop.php?sort=price_desc&page=1', '2026-02-06', '16:29:23', '127.0.0.1'),
(752, '/shop.php?category_id=&min_price=0&max_price=1000000&room_id=&color_ids%5B%5D=19&color_ids%5B%5D=6', '2026-02-06', '16:29:26', '127.0.0.1'),
(753, '/shop.php?category_id=&min_price=0&max_price=1000000&room_id=&color_ids%5B%5D=10&color_ids%5B%5D=13&color_ids%5B%5D=6', '2026-02-06', '16:29:29', '127.0.0.1'),
(754, '/shop.php?category_id=&min_price=0&max_price=1000000&room_id=&color_ids%5B%5D=10&color_ids%5B%5D=13&color_ids%5B%5D=4&color_ids%5B%5D=6&color_ids%5B%5D=14', '2026-02-06', '16:29:31', '127.0.0.1'),
(755, '/shop.php?category_id=&min_price=0&max_price=1000000&room_id=&color_ids%5B0%5D=10&color_ids%5B1%5D=13&color_ids%5B2%5D=4&color_ids%5B3%5D=6&color_ids%5B4%5D=14&page=2', '2026-02-06', '16:29:33', '127.0.0.1'),
(756, '/shop.php?category_id=&min_price=0&max_price=1000000&room_id=&color_ids%5B0%5D=10&color_ids%5B1%5D=13&color_ids%5B2%5D=4&color_ids%5B3%5D=6&color_ids%5B4%5D=14&page=1', '2026-02-06', '16:29:34', '127.0.0.1'),
(757, '/shop.php?category_id=&min_price=0&max_price=1000000&room_id=&color_ids%5B0%5D=10&color_ids%5B1%5D=13&color_ids%5B2%5D=4&color_ids%5B3%5D=6&color_ids%5B4%5D=14&page=2', '2026-02-06', '16:29:35', '127.0.0.1'),
(758, '/shop.php?category_id=&min_price=0&max_price=1000000&room_id=&color_ids%5B0%5D=10&color_ids%5B1%5D=13&color_ids%5B2%5D=4&color_ids%5B3%5D=6&color_ids%5B4%5D=14&page=1&sort=price_asc', '2026-02-06', '16:29:36', '127.0.0.1'),
(759, '/index.php', '2026-02-06', '16:29:39', '127.0.0.1'),
(760, '/login.php', '2026-02-06', '16:29:41', '127.0.0.1'),
(761, '/login.php', '2026-02-06', '16:29:43', '127.0.0.1'),
(762, '/profile.php', '2026-02-06', '16:29:44', '127.0.0.1'),
(763, '/', '2026-02-06', '16:35:19', '127.0.0.1'),
(764, '/product.php?id=7', '2026-02-06', '16:35:24', '127.0.0.1'),
(765, '/product.php?id=7', '2026-02-06', '16:35:29', '127.0.0.1'),
(766, '/product.php?id=7', '2026-02-06', '16:35:49', '127.0.0.1'),
(767, '/product.php?id=7', '2026-02-06', '16:35:59', '127.0.0.1'),
(768, '/product.php?id=7', '2026-02-06', '16:36:00', '127.0.0.1'),
(769, '/product.php?id=7', '2026-02-06', '16:36:00', '127.0.0.1'),
(770, '/product.php?id=7', '2026-02-06', '16:36:01', '127.0.0.1'),
(771, '/product.php?id=7', '2026-02-06', '16:36:02', '127.0.0.1'),
(772, '/shop.php', '2026-02-06', '16:36:49', '127.0.0.1'),
(773, '/shop.php?category_id=&min_price=0&max_price=1000000&room_id=2', '2026-02-06', '16:36:53', '127.0.0.1'),
(774, '/product.php?id=15', '2026-02-06', '16:36:58', '127.0.0.1'),
(775, '/product.php?id=15', '2026-02-06', '16:37:02', '127.0.0.1'),
(776, '/product.php?id=15', '2026-02-06', '16:37:03', '127.0.0.1'),
(777, '/product.php?id=15', '2026-02-06', '16:37:03', '127.0.0.1'),
(778, '/product.php?id=15', '2026-02-06', '16:37:04', '127.0.0.1'),
(779, '/product.php?id=15', '2026-02-06', '16:37:05', '127.0.0.1'),
(780, '/product.php?id=15', '2026-02-06', '16:37:05', '127.0.0.1'),
(781, '/product.php?id=15', '2026-02-06', '16:37:06', '127.0.0.1'),
(782, '/', '2026-02-06', '16:37:22', '127.0.0.1'),
(783, '/shop.php', '2026-02-06', '16:37:54', '127.0.0.1'),
(784, '/product.php?id=21', '2026-02-06', '16:38:12', '127.0.0.1'),
(785, '/index.php', '2026-02-06', '16:39:11', '127.0.0.1'),
(786, '/about.php', '2026-02-06', '16:39:37', '127.0.0.1'),
(787, '/shop.php', '2026-02-06', '16:40:29', '127.0.0.1'),
(788, '/index.php', '2026-02-06', '16:40:30', '127.0.0.1'),
(789, '/shop.php', '2026-02-06', '16:40:57', '127.0.0.1'),
(790, '/about.php', '2026-02-06', '16:40:58', '127.0.0.1');

-- --------------------------------------------------------

--
-- Структура таблицы `wishlist`
--

CREATE TABLE `wishlist` (
  `id` int NOT NULL,
  `user_id` int NOT NULL,
  `product_id` int NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `wishlist`
--

INSERT INTO `wishlist` (`id`, `user_id`, `product_id`, `created_at`) VALUES
(30, 2, 24, '2026-02-03 13:49:55'),
(36, 2, 20, '2026-02-03 13:56:04'),
(37, 2, 19, '2026-02-03 13:56:05'),
(38, 2, 22, '2026-02-03 13:56:08'),
(39, 2, 18, '2026-02-03 13:56:14'),
(40, 2, 17, '2026-02-03 13:56:15'),
(41, 2, 16, '2026-02-03 13:56:15'),
(80, 1, 16, '2026-02-03 17:02:48'),
(93, 2, 26, '2026-02-05 13:22:29'),
(94, 3, 22, '2026-02-05 15:58:55'),
(95, 3, 26, '2026-02-05 15:58:56'),
(96, 3, 24, '2026-02-05 15:58:57'),
(100, 1, 26, '2026-02-05 16:37:41'),
(101, 1, 21, '2026-02-05 16:50:47'),
(102, 5, 5, '2026-02-06 12:51:06'),
(104, 6, 24, '2026-02-06 13:26:48'),
(106, 6, 26, '2026-02-06 13:28:42');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `attr_categories`
--
ALTER TABLE `attr_categories`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Индексы таблицы `attr_category_links`
--
ALTER TABLE `attr_category_links`
  ADD PRIMARY KEY (`id`),
  ADD KEY `parent_cat_id` (`parent_cat_id`),
  ADD KEY `linked_cat_id` (`linked_cat_id`);

--
-- Индексы таблицы `attr_colors`
--
ALTER TABLE `attr_colors`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Индексы таблицы `attr_materials`
--
ALTER TABLE `attr_materials`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Индексы таблицы `attr_rooms`
--
ALTER TABLE `attr_rooms`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Индексы таблицы `attr_room_links`
--
ALTER TABLE `attr_room_links`
  ADD PRIMARY KEY (`id`),
  ADD KEY `room_id` (`room_id`),
  ADD KEY `linked_cat_id` (`linked_cat_id`);

--
-- Индексы таблицы `attr_styles`
--
ALTER TABLE `attr_styles`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Индексы таблицы `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `order_items`
--
ALTER TABLE `order_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `order_id` (`order_id`),
  ADD KEY `product_id` (`product_id`);

--
-- Индексы таблицы `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_prod_cat` (`category_id`),
  ADD KEY `fk_prod_color` (`color_id`),
  ADD KEY `fk_prod_material` (`material_id`),
  ADD KEY `fk_prod_style` (`style_id`),
  ADD KEY `fk_prod_room` (`room_id`);

--
-- Индексы таблицы `product_images`
--
ALTER TABLE `product_images`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_product` (`product_id`);

--
-- Индексы таблицы `product_related`
--
ALTER TABLE `product_related`
  ADD PRIMARY KEY (`id`),
  ADD KEY `product_id` (`product_id`),
  ADD KEY `related_id` (`related_id`);

--
-- Индексы таблицы `settings`
--
ALTER TABLE `settings`
  ADD PRIMARY KEY (`key`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`);

--
-- Индексы таблицы `visit_logs`
--
ALTER TABLE `visit_logs`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `wishlist`
--
ALTER TABLE `wishlist`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `user_id` (`user_id`,`product_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `attr_categories`
--
ALTER TABLE `attr_categories`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT для таблицы `attr_category_links`
--
ALTER TABLE `attr_category_links`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `attr_colors`
--
ALTER TABLE `attr_colors`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT для таблицы `attr_materials`
--
ALTER TABLE `attr_materials`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT для таблицы `attr_rooms`
--
ALTER TABLE `attr_rooms`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT для таблицы `attr_room_links`
--
ALTER TABLE `attr_room_links`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT для таблицы `attr_styles`
--
ALTER TABLE `attr_styles`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT для таблицы `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;

--
-- AUTO_INCREMENT для таблицы `order_items`
--
ALTER TABLE `order_items`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=54;

--
-- AUTO_INCREMENT для таблицы `products`
--
ALTER TABLE `products`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;

--
-- AUTO_INCREMENT для таблицы `product_images`
--
ALTER TABLE `product_images`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT для таблицы `product_related`
--
ALTER TABLE `product_related`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `visit_logs`
--
ALTER TABLE `visit_logs`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=791;

--
-- AUTO_INCREMENT для таблицы `wishlist`
--
ALTER TABLE `wishlist`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=107;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `attr_category_links`
--
ALTER TABLE `attr_category_links`
  ADD CONSTRAINT `attr_category_links_ibfk_1` FOREIGN KEY (`parent_cat_id`) REFERENCES `attr_categories` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `attr_category_links_ibfk_2` FOREIGN KEY (`linked_cat_id`) REFERENCES `attr_categories` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `attr_room_links`
--
ALTER TABLE `attr_room_links`
  ADD CONSTRAINT `attr_room_links_ibfk_1` FOREIGN KEY (`room_id`) REFERENCES `attr_rooms` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `attr_room_links_ibfk_2` FOREIGN KEY (`linked_cat_id`) REFERENCES `attr_categories` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `orders`
--
ALTER TABLE `orders`
  ADD CONSTRAINT `orders_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `order_items`
--
ALTER TABLE `order_items`
  ADD CONSTRAINT `order_items_ibfk_1` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `order_items_ibfk_2` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `products`
--
ALTER TABLE `products`
  ADD CONSTRAINT `fk_prod_cat` FOREIGN KEY (`category_id`) REFERENCES `attr_categories` (`id`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_prod_color` FOREIGN KEY (`color_id`) REFERENCES `attr_colors` (`id`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_prod_material` FOREIGN KEY (`material_id`) REFERENCES `attr_materials` (`id`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_prod_room` FOREIGN KEY (`room_id`) REFERENCES `attr_rooms` (`id`) ON DELETE SET NULL ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_prod_style` FOREIGN KEY (`style_id`) REFERENCES `attr_styles` (`id`) ON DELETE SET NULL ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `product_images`
--
ALTER TABLE `product_images`
  ADD CONSTRAINT `fk_product` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `product_related`
--
ALTER TABLE `product_related`
  ADD CONSTRAINT `product_related_ibfk_1` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `product_related_ibfk_2` FOREIGN KEY (`related_id`) REFERENCES `products` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
